{
	"id": 1,
	"name": "Developer Day 2013",
	"location": "BEA Expo",
	"date": "12.12.2013",
	"speakers": [
		{
			"id": 1,
			"name": "Stefano",
			"surname": "Trentini",
			"email": "",
			"company": "K-IT-SWE",
			"picture": "pict1.jpg",
			"bio": ""
		},
		{
			"id": 2,
			"name": "Markus",
			"surname": "Riesch",
			"email": "xxx@xxx.ch",
			"company": "Stiftung “Zugang für alle”",
			"picture": "pict2.jpg",
			"bio": "Markus Riesch hat an der ETH Zürich Maschinenbau und Betriebs- und Produktionswissenschaften studiert. Er ist Geschäftsführer der gemeinnützigen Stiftung «Zugang für alle», für welche er seit 2004 arbeitet. Markus Riesch vertritt die Anliegen von Menschen mit Behinderung bei der Nutzung von ICT in verschiedenen nationalen und internationalen Gremien. Im Jahr 2006 lancierte er das Schweizer Zertifikat für barrierefreie Websites der Stiftung «Zugang für alle». 2007 und 2011 war Markus Riesch Herausgeber der Schweizer Accessibility-Studie.\n Markus Riesch ist Experte für die Gestaltung barrierefreier Websites und Applikationen und berät zahlreiche nationale und internationale Organisationen und Unternehmen."
		},
		{
			"id": 3,
			"name": "Daniele",
			"surname": "Corciulo",
			"email": "xxx@xxx.ch",
			"company": "Stiftung “Zugang für alle”",
			"picture": "pict3.jpg",
			"bio": "Daniele Corciulo startete im August 2009 die Arbeit bei der Stiftung «Zugang für alle». Daniele ist selbst blind und absolvierte bei der Stiftung «Zugang für alle» eine Weiterbildung zum ECDL-Webmaster und Accessibility-Spezialist. Daniele Corciulo beschäftigt sich insbesondere mit Web Accessibility, mobile Apps mit dem Thema \"barrierefreie PDF-Dokumente\". Als Blinder kennt er die Anforderungen und Herausforderungen aus erster Hand. Als Accessibiltiy-Spezalist für Screenreader-Nutzung untersucht Daniele Corciulo Websites und Applikationen und erarbei-tet Verbesserungsvorschläge."
		},
		{
			"id": 4,
			"name": "Jürg",
			"surname": "Hiltbrunner",
			"email": "xxx@xxx.ch",
			"company": "IT-OM-PSV-BPF",
			"picture": "pict4.jpg",
			"bio": "Jürg Hiltbrunner ist seit 2011 als Oracle Datenbank Engineer bei SBB tätig.\n - 2013 Diploma of Advanced Studies (Berner Fachhochschule)\n - 2012 Oracle Database 11 Performance Tuning Certified Expert\n - 2011 OCP 11g (Oracle Certified Professional)\n - 1996 bis jetzt im DB-Umfeld auf Oracle und Mainframe"
		},
		{
			"id": 5,
			"name": "Simon",
			"surname": "Krenger",
			"email": "xxx@xxx.ch",
			"company": "IT-OM-PSV-BPF",
			"picture": "pict5.jpg",
			"bio": "Simon Krenger ist seit 2012 bei der SBB als Oracle Datenbank-Engineer tätig. Nebenbei studiert er Informatik an der Berner Fach-hochschule\n - 2012 OCA 11g (Oracle Certified Associate)\n - Seit 2011 BSc. in Computer Science\n - Seit 2009 Datenbank-Erfahrung mit Oracle und MySQL"
		},
		{
			"id": 6,
			"name": "Marc",
			"surname": "Hoffmann",
			"email": "xxx@xxx.ch",
			"company": "mtrail GmbH",
			"picture": "pict6.jpg",
			"bio": "Marc Hoffmann beschäftigt sich als Autor der Open Source Werkzeuge JaCoCo und EclEmma für die Code Coverage Analayse seit vielen Jahren mit der Arbeitsweise von Java Compilern und Java Virtual Machines. Beruflich arbeitet Marc als Softwarearchitekt für die Firma mtrail GmbH in Bern und unterstützt die SBB im Projekt Rail Control System (RCS)."
		},
		{
			"id": 7,
			"name": "Michael",
			"surname": "Krausse",
			"email": "xxx@xxx.ch",
			"company": "IT-SWE-CD2-T25",
			"picture": "pict7.jpg",
			"bio": "Software Engineer bei der SBB seit April 2013 im Projekt SVS.\nSchwerpunkt: Individuelle Softwareentwicklung."
		},
		{
			"id": 8,
			"name": "Aravindo",
			"surname": "Wingeier",
			"email": "xxx@xxx.ch",
			"company": "IT-SWE-CD3-T33",
			"picture": "pict8.jpg",
			"bio": "Software Engineer bei der SBB seit 2009 in Applikation CID Infra und Projekt OraCIS."
		},
		{
			"id": 9,
			"name": "Michael",
			"surname": "Künzli",
			"email": "xxx@xxx.ch",
			"company": "IT-SWE-TF2-TS2",
			"picture": "pict9.jpg",
			"bio": "Mein Vater kam aus Will, meine Mutter aus Freiburg und ich bin in Genf geboren! Ich bin verheiratet und lebe mit meinen 2 Töchtern in Düdingen. Nach einer kaufmännischen Lehre absolvierte ich die Ingenieurschule in Wirtschaftsinformatik in Biel (1992). In 1999 habe ich ein Nachdip-lom bei der NDIT abgeschlossen und dieses Jahr ein EMBA in „Integrated Management“. Ich habe hauptsächlich in diversen Dienstleitungsfirmen als Entwickler, Analytiker, Projektleiter und Linienverantwortlicher gearbeitet. In der SBB-IT habe ich mich mit dem Thema Qualität beschäftigt. In meiner Freizeit kümmere ich mich in Winter um unseren Wald und sonst um unseren Familiengarten. Wandern, soziale Einsätze und Vater sein gehören ebenfalls zu meinen Beschäftigungen."
		},
		{
			"id": 10,
			"name": "Michael",
			"surname": "Beyer",
			"email": "xxx@xxx.ch",
			"company": "IT-SCI-TOP-UNO",
			"picture": "pict10.jpg",
			"bio": "Seit 7 Jahren bei der SBB in den verschiedensten Rollen (Software Entwickler, Architekt, Projektleiter) in den Projekten NeTS und RCS tätig und seit Anfang 2012 Leiter von UNO. Neben Informatik habe ich noch ein Studium der Gesellschafts-, Kultur und Religionswissenschaften absolviert."
		}
	],
	"talks": [
		{
			"id": "cafe",
			"title": "Begrüssungscafe",
			"abstract": ""
		},
		{
			"id": "begrüssung",
			"title": "Begrüssung Developer Day 2013",
			"abstract": ""
		},
		{
			"id": "pause",
			"title": "*** PAUSE ***",
			"abstract": ""
		},
		{
			"id": "keynote",
			"title": "Keynote 1 - Herausforderung Accessibility – Chancen für Menschen mit Behinderungen, Stolpersteine für Entwickler",
			"abstract": "Zugang zu Informations- und Kommunikationstechnologien bedeutet für Menschen mit Behinderungen mehr als für alle anderen. Der barrierefreie Zugang ermöglicht mehr Chancengleichheit und Selbstständigkeit im privaten und beruflichen Leben. Im ersten Teil der Keynote wird aufgezeigt, für was das Konzept Accessibility steht, wer alles davon profitiert, welche unterschiedlichen Bedürfnisse es gibt und wie diese durch assistierende Technologien unterstützt werden können. Im zweiten Teil wird live vorgestellt, was es heisst „blind“ einen Computer oder ein iPhone zu bedienen und wie Websites und Apps benutzt werden können oder wo teils unüberwindbare Hürden auftauchen. Am Schluss werden häufige Stolpersteine bei der Umsetzung von Rich Internet Applications in Websites durch den Einsatz von JS und AJAX aufgezeigt."
		},
		{
			"id": "a1",
			"title": "A1 – Oracle Datenbank 12c: Die Wolke aus der Steckdose",
			"abstract": "Die Oracle 12c Datenbank steht seit diesem Sommer zur Verfügung. Ab nächstem Jahr ist Oracle 12c auch gemäss ABC-Liste bei uns verfügbar und bestellbar. Wir stellen euch einige neue Features der 12c Datenbank vor. Mittels Demos zeigen wir, wie einfach und schnell in einer Container Datenbank eine weitere „Pluggable Database“ erstellt werden kann. Weiter stellen wir vor, was in SQL erweitert wurde und welche neuen Features Entwickler nutzen können. An diesem Vortrag erfährt ihr somit viele nützliche Informationen und Neuigkeiten zur neuen 12c Datenbank, welche euch die Arbeit vereinfachen werden."
		},
		{
			"id": "a2",
			"title": "A2 - Let’s make some 0xCAFEBABE!",
			"abstract": "Eine Einführung in die Grundlagen des Java Class-Fileformats und der Arbeitsweise der Java Virtual Machine.\n Die Java Virtual Machine ist heutzutage das „Arbeitspferd“ hinter vielen Server- und Client-Anwendungen. Zur Ausführung in der JMV gelangen sogenannte Class-Files, die aus Java-Sourcecode und anderen Sprachen kompiliert oder auch dynamisch erzeugt werden. Um solche Class-Files selber zu generieren, modifizieren, verifizieren oder analysieren zu können, muss man ihre Struktur sowie die grundlegende Funktionsweise der Virtual Machine kennen. Dieses Wissen ist insbesondere auch hilfreich beim Verständnis von Performance-, Speicher- und Nebenläufigkeitsaspekten von Java-Anwendungen."
		},
		{
			"id": "a3",
			"title": "A3 – HTML 5 & CSS 3 bei SBB-IT",
			"abstract": "HTML5 & CSS3 ist in aller Munde. Höchste Zeit, dass die SBB konzentriert ein Auge darauf wirft. Aus diesem Grund beschäftigt sich ein Vertiefungsthema von STT Java:Core seit Juli mit diesem Thema. Das Hauptziel ist, internes Know-How aufzubauen und zu prüfen, ob diese Technologie in der SBB eingesetzt wer-den kann oder nicht. Der Vortrag wird einen Überblick über die erarbeiteten Themen (Offline & Storage, Kommunikation Client-Server, etc.) bieten und einzelne Bereiche detailliert betrachten. Dabei werden technische Details und Möglich-keiten hervorgehoben. Das Publikum wird die Möglichkeit haben, erarbeitete Showcases zu betrachten."
		},
		{
			"id": "a4",
			"title": "A4 - Inspiration – Umsetzung - Agilität",
			"abstract": "„Ein Unternehmen ohne Ordnung ist unfähig zu überleben und ein Unternehmen ohne Unordnung ist unfähig sich zu entwickeln“. Wie wird beim Erreichen von Zielen Energie erzeugt, Verschwendung vermieden, Vision vermittelt, Verantwor-tung getragen und Sinn erlebt, so dass für alle Beteiligten optimale Ergebnisse resultieren? Auf den Ebenen „Individuum“, „Team“ und „Führung“ zeigen die Referenten in einem Dialog auf, wie sich theoretische Modelle mit täglicher Praxis verbinden lassen.  Die Zusammenarbeit als mächtiger Hebel um das systemische Glück (persönliche und organisatorische) zu erreichen, wird exemplarisch dargelegt. Diese Zusammenfassung stammt aus der Diplomarbeit „Collaborations@SBB-IT“ und Praktiken aus „Kanban@UNO“."
		}
	],
	"tracks": [
		{
			"id": "coreTec",
			"title": "Core Tec",
			"talks": [
				{
					"talkId": "cafe",
					"speakerIds": [],
					"time": {
						"start": "08:30",
						"end": "09:00"
					},
					"room": "Foyer 1 Catering"
				},
				{
					"talkId": "begrüssung",
					"speakerIds": [1],
					"time": {
						"start": "09:00",
						"end": "09:10"
					},
					"room": "Kongressraum 1"
				},
				{
					"talkId": "keynote",
					"speakerIds": [2, 3],
					"time": {
						"start": "09:10",
						"end": "10:00"
					},
					"room": "Kongressraum 1"
				},
				{
					"talkId": "pause",
					"speakerIds": [],
					"time": {
						"start": "10:00",
						"end": "10:25"
					},
					"room": "Foyer 1 Catering"
				},
				{
					"talkId": "a1",
					"speakerIds": [4, 5],
					"time": {
						"start": "10:25",
						"end": "11:10"
					},
					"room": "Kongressraum 3"
				}
			]
		},
		{
			"id": "javaTec",
			"title": "Java Tec",
			"talks": [
				{
					"talkId": "cafe",
					"speakerIds": [],
					"time": {
						"start": "08:30",
						"end": "09:00"
					},
					"room": "Foyer 1 Catering"
				},
				{
					"talkId": "begrüssung",
					"speakerIds": [1],
					"time": {
						"start": "09:00",
						"end": "09:10"
					},
					"room": "Kongressraum 1"
				},
				{
					"talkId": "keynote",
					"speakerIds": [2, 3],
					"time": {
						"start": "09:10",
						"end": "10:00"
					},
					"room": "Kongressraum 1"
				},
				{
					"talkId": "pause",
					"speakerIds": [],
					"time": {
						"start": "10:00",
						"end": "10:25"
					},
					"room": "Foyer 1 Catering"
				},
				{
					"talkId": "a2",
					"speakerIds": [6],
					"time": {
						"start": "10:25",
						"end": "11:10"
					},
					"room": "Kongressraum 4"
				}
			]
		},
		{
			"id": "beyondNow",
			"title": "Beyond Now",
			"talks": [
				{
					"talkId": "cafe",
					"speakerIds": [],
					"time": {
						"start": "08:30",
						"end": "09:00"
					},
					"room": "Foyer 1 Catering"
				},
				{
					"talkId": "begrüssung",
					"speakerIds": [1],
					"time": {
						"start": "09:00",
						"end": "09:10"
					},
					"room": "Kongressraum 1"
				},
				{
					"talkId": "keynote",
					"speakerIds": [2, 3],
					"time": {
						"start": "09:10",
						"end": "10:00"
					},
					"room": "Kongressraum 1"
				},
				{
					"talkId": "pause",
					"speakerIds": [],
					"time": {
						"start": "10:00",
						"end": "10:25"
					},
					"room": "Foyer 1 Catering"
				},
				{
					"talkId": "a3",
					"speakerIds": [7, 8],
					"time": {
						"start": "10:25",
						"end": "11:10"
					},
					"room": "Kongressraum 1"
				}
			]
		},
		{
			"id": "engineeringArts",
			"title": "Engineering Arts",
			"talks": [
				{
					"talkId": "cafe",
					"speakerIds": [],
					"time": {
						"start": "08:30",
						"end": "09:00"
					},
					"room": "Foyer 1 Catering"
				},
				{
					"talkId": "begrüssung",
					"speakerIds": [1],
					"time": {
						"start": "09:00",
						"end": "09:10"
					},
					"room": "Kongressraum 1"
				},
				{
					"talkId": "keynote",
					"speakerIds": [2, 3],
					"time": {
						"start": "09:10",
						"end": "10:00"
					},
					"room": "Kongressraum 1"
				},
				{
					"talkId": "pause",
					"speakerIds": [],
					"time": {
						"start": "10:00",
						"end": "10:25"
					},
					"room": "Foyer 1 Catering"
				},
				{
					"talkId": "a4",
					"speakerIds": [9, 10],
					"time": {
						"start": "10:25",
						"end": "11:10"
					},
					"room": "Kongressraum 6"
				}
			]
		}
	]
}