{
  "id": 99999,
  "name": "SBB IT Developer Day 2016",
  "location": "Gurten",
  "date": "08.09.2016",
  "speakers": [
    {
      "id": 1,
      "name": "Adrian",
      "surname": "Egli",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ae.jpg",
      "bio": ""
    },
    {
      "id": 2,
      "name": "Andreas",
      "surname": "Schlapbach",
      "email": "",
      "company": "IT-SCP",
      "picture": "images/referenten/as.jpg",
      "bio": ""
    },
    {
      "id": 3,
      "name": "Baltisar",
      "surname": "Oswald",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/bo.jpg",
      "bio": ""
    },
    {
      "id": 4,
      "name": "Beat",
      "surname": "Wettstein",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/bw.jpg",
      "bio": ""
    },
    {
      "id": 5,
      "name": "Christian",
      "surname": "Egli",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ce.jpg",
      "bio": ""
    },
    {
      "id": 6,
      "name": "Christian",
      "surname": "Eichenberger",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ce1.jpg",
      "bio": ""
    },
    {
      "id": 7,
      "name": "Christoph",
      "surname": "Trutmann",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ct.jpg",
      "bio": ""
    },
    {
      "id": 8,
      "name": "Claude-Alain",
      "surname": "Brohy",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/cab.jpg",
      "bio": ""
    },
    {
      "id": 9,
      "name": "Daniel",
      "surname": "Agile Marthaler",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/dm.jpg",
      "bio": ""
    },
    {
      "id": 10,
      "name": "Dominik",
      "surname": "Schmucki",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ds.jpg",
      "bio": ""
    },
    {
      "id": 11,
      "name": "Franco",
      "surname": "Ehrat",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/fe.jpg",
      "bio": ""
    },
    {
      "id": 12,
      "name": "Florian",
      "surname": "Brunner",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/fb.jpg",
      "bio": ""
    },
    {
      "id": 13,
      "name": "Florian",
      "surname": "Seidl",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/fs.jpg",
      "bio": ""
    },
    {
      "id": 14,
      "name": "Heiko",
      "surname": "Hünnefeld",
      "email": "",
      "company": "IT-SCI",
      "picture": "images/referenten/hh.jpg",
      "bio": ""
    },
    {
      "id": 15,
      "name": "Ivo",
      "surname": "Hechmann",
      "email": "",
      "company": "IT-OM",
      "picture": "images/referenten/ih.jpg",
      "bio": ""
    },
    {
      "id": 16,
      "name": "Jonas",
      "surname": "Bandi",
      "email": "",
      "company": "jonasbandi.net",
      "picture": "images/referenten/jb.jpg",
      "bio": "Jonas Bandi hat 15 Jahre Erfahrung als Entwickler in Enterprise-Projekten. Aktuell arbeitet er als Freelancer in verschiedenen Entwicklungs- und Beratungsmandaten mit dem Fokus auf der Realisierung von komplexen Web-Applikationen. Daneben unterrichtet er seit 9 Jahren an der Berner Fachhochschule, unteranderem im CAS 'Applikationsentwicklung mit JavaScript & HTML5'. In den letzen Jahren hat er ausserdem viele InHouse-Kurse und Coachings für moderene Webentwicklung und AngularJS im Enterprise Umfeld durchgeführt."
    },
    {
      "id": 17,
      "name": "Lukas",
      "surname": "Eder",
      "email": "",
      "company": "Data Geekery GmbH",
      "picture": "images/referenten/le.jpg",
      "bio": "Lukas ist Java Champion, Vorstandsmitglied der JUG.ch, der Mann hinter jOOQ, und verbringt seine Zeit am liebsten mit dem Tunen von kompliziertem SQL."
    },
    {
      "id": 18,
      "name": "Markus",
      "surname": "Färber",
      "email": "",
      "company": "IT-SCP",
      "picture": "images/referenten/mf1.jpg",
      "bio": ""
    },
    {
      "id": 19,
      "name": "Michael",
      "surname": "Esser",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/me.jpg",
      "bio": ""
    },
    {
      "id": 20,
      "name": "Michael",
      "surname": "Fetzer",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/mf.jpg",
      "bio": ""
    },
    {
      "id": 21,
      "name": "Mike",
      "surname": "Morgenthaler",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/mm.jpg",
      "bio": ""
    },
    {
      "id": 22,
      "name": "Patrick",
      "surname": "Spiegel",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ps.jpg",
      "bio": ""
    },
    {
      "id": 23,
      "name": "Peter",
      "surname": "Moosmann",
      "email": "",
      "company": "IT-AQ",
      "picture": "images/referenten/pm.jpg",
      "bio": ""
    },
    {
      "id": 24,
      "name": "Philipp",
      "surname": "Kasiotis",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/pk.jpg",
      "bio": ""
    },
    {
      "id": 25,
      "name": "Philipp",
      "surname": "Oser",
      "email": "",
      "company": "Elca Informatik AG",
      "picture": "images/referenten/po.jpg",
      "bio": ""
    },
    {
      "id": 26,
      "name": "Philippe",
      "surname": "Robert",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/pr.jpg",
      "bio": ""
    },
    {
      "id": 27,
      "name": "Ramon",
      "surname": "Spahr",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/rs.jpg",
      "bio": ""
    },
    {
      "id": 28,
      "name": "Reto",
      "surname": "Lehmann",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/rl.jpg",
      "bio": ""
    },
    {
      "id": 29,
      "name": "Roland",
      "surname": "Berger",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/rg.jpg",
      "bio": ""
    },
    {
      "id": 30,
      "name": "Sebastian",
      "surname": "Graf",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/sg.jpg",
      "bio": ""
    },
    {
      "id": 31,
      "name": "Simon",
      "surname": "Martinelli",
      "email": "",
      "company": "simas GmbH",
      "picture": "images/referenten/sm.jpg",
      "bio": "Simon Martinelli ist Geschäftsführer der simas GmbH und als Software Architekt, Entwickler, Berater und Trainer im Java EE Umfeld tätig.  Er verfügt über 20 Jahre Erfahrung in der Software Entwicklung in verschiedenen Rollen in Projekten unterschiedlicher Grösse. Durch seine Tätigkeit als Dozent an der Berner Fachhochschule (SWS) in den Bereichen Java EE Architektur und Design, Persistenztechnologien und DevOps kann er seine Interessen vertiefen und sein Know-How weitergeben."
    },
    {
      "id": 32,
      "name": "Stefan",
      "surname": "Aeschbacher",
      "email": "",
      "company": "PostAuto AG",
      "picture": "images/referenten/sa.jpg",
      "bio": "Stefan Aeschbacher ist dipl. Ing. EPFL und Certified Systems Engineering Professional (CSEP). Nach dem Studium hat er sich selbständig gemacht und eine IT-Security Firma gegründet. Sein Arbeitsgebiet hat sich schon bald von der Security in Richtung öffentlicher Verkehr gewandelt. Im Rahmen verschiedener Projekte hat er an der Modernisierung der Informatik-Infrastruktur verschiedener Eisenbahn-Flotten mitgearbeitet. Nach einem Abstecher ins Ticketing mit dem Projekt BIBO hat er im Jahr 2014 den Wechsel von der Schiene auf die Strasse vollzogen und leitet nun die Entwicklung im Projekt ISA von PostAuto. Er ist Gründungsmitglied der Swiss Society of Systems Engineering (SSSE) und deren aktueller Präsident."
    },
    {
      "id": 33,
      "name": "Stefan",
      "surname": "Toth",
      "email": "",
      "company": "embarc GmbH",
      "picture": "images/referenten/st1.jpg",
      "bio": "Stefan Toth (stefan.toth@embarc.de) ist Geschäftsführer der embarc GmbH, Sprecher auf internationalen Konferenzen und Buchautor. Er unterstützt Unternehmen aus unterschiedlichen Branchen im Bereich Software- und Unternehmensarchitektur. Sein größtes Kapital ist der breite technologische Kontext und seine methodische Erfahrung aus dynamischen IT-Unternehmen."
    },
    {
      "id": 34,
      "name": "Stefan",
      "surname": "Zeller",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/sz.jpg",
      "bio": ""
    },
    {
      "id": 35,
      "name": "Stefano",
      "surname": "Trentini",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/st.jpg",
      "bio": ""
    },
    {
      "id": 36,
      "name": "Thomas",
      "surname": "Siegrist",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ts.jpg",
      "bio": ""
    },
    {
      "id": 37,
      "name": "Tobias",
      "surname": "Denzler",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/td.jpg",
      "bio": ""
    },
    {
      "id": 38,
      "name": "Yannis",
      "surname": "Baillet",
      "email": "",
      "company": "IT-AQ",
      "picture": "images/referenten/yb.jpg",
      "bio": ""
    }
  ],
  "talks": [
    {
      "id": "intro",
      "title": "Begrüssung & Infos",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "eroeffnungsrede",
      "title": "Eröffnungsrede",
      "abstract": "",
      "speakerIds": [
        35
      ],
      "common": true
    },
    {
      "id": "keynote1",
      "title": "Keynote 1 - Wie kommt die Software ins PostAuto?",
      "abstract": "<p>PostAuto ersetzt im Rahmen des Grossprojektes ISA (Integrierte Systemarchitektur) die IT-Infrastruktur auf den ca. 2500 Fahrzeugen. Betroffene Systeme sind unter anderem der Ticketverkauf für den Fahrer, die Fahrgastzählung oder die Fahrgastinformation. Im Sinne eines Paradigmenwechsels hat PostAuto entschieden den Grossteil der Systeme modular neu zu entwickeln und nicht mehr mit einem Systemlieferanten zu arbeiten. Die Software wird mit externen Partnern oder der IT-Post nach Scrum entwickelt. Zum Einsatz kommen Technologien wie Java, Docker oder AngularJS welche für die Bus-Branche Neuland darstellen. Die vorwiegend auf Microservices basierende Architektur wird kontinuierlich integriert und automatisiert getestet. Wo sinnvoll wurden Kooperationen innerhalb des Post-Konzerns oder auch mit öV-Partnern wie den SBB eingegangen.</p>",
      "speakerIds": [
        32
      ],
      "common": true
    },
    {
      "id": "keynote2",
      "title": "Keynote 2 - Speed IT up - Die schnelle Art der Softwareentwicklung",
      "abstract": "<p>Internet-Firmen arbeiten in einem sehr dynamischen Umfeld. Start-Ups mischen regelmäßig die Szene auf, Benutzer sind sehr empfänglich für bessere Angebote der Konkurrenz und die Menge an Benutzern ist direkt für den Erfolg relevant. In diesem Kontext haben sich Firmen auf schnelle Time-to-Market und stetige Innovation eingerichtet. Mit der Digitalisierung treten nun sehr klassisch strukturierte Firmen auf die gleiche Bühne und müssen sich mit Internet Start-Ups messen. Diese Keynote beschäftigt sich mit den Erfolgsmodellen schneller IT-Firmen, den organisatorischen und technischen Herausforderungen die Konzerne zu überwinden haben und den Kompromissen die damit einhergehen.</p>",
      "speakerIds": [
        33
      ],
      "common": true
    },
    {
      "id": "pause",
      "title": "Pause",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "mittagessen",
      "title": "Mittagessen",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "A1",
      "title": "A1 – Reaktiv statt proaktiv - Akka und seine Einsatzmöglichkeiten im Cloud-Umfeld",
      "abstract": "<p>Begriffe wie “Reactive Programming“, „Actor Model Framework“ oder auch das Reactive Manifesto existieren schon einige Jahre und sind alles andere als neu. Es erstaunt daher umso mehr, dass dieses Paradigma bei der SBB noch nicht vermehrt Einzug gehalten hat? Akka als „leichtgewichtiger Vertreter“ dieser Kategorie bringt eigentlich alle Voraussetzungen mit, um erfolgreich auf der JVM bzw. im Java-Umfeld eingesetzt werden zu können. Anhand von Beispielen und Erfahrungen aus dem Projekt Redko möchten wir dies beweisen.</p>",
      "speakerIds": [
        22
      ],
      "common": false
    },
    {
      "id": "A2",
      "title": "A2 - Jenkins: von Continuous Integration zu Continuous Delivery - alles Pipeline oder was?",
      "abstract": "<p>Software is eating the world - auch in der Software-Entwicklung selber: Config as Code! Mit Jenkins 2.0 werden Job-Konfiguration mit dem Quell-Code eingecheckt und Jobs generiert. <ul><li>Alles ist Pipeline</li><li>Jobs as Code: DSL</li><li>WZU-Infrastruktur</li></ul></p>",
      "speakerIds": [
        6
      ],
      "common": false
    },
    {
      "id": "A3",
      "title": "A3 - Der Software Entwickler – Mensch oder Ressource?",
      "abstract": "<p>In meinen 21 Jahre in verschiedenen Rollen in der Software Entwicklung habe ich festgestellt, dass sich vor allem bei grossen Firmen der Wert und die Rolle des Software Entwicklers stark gewandelt hat. Viele Unternehmen sprechen von Entwickler-Pools und Ressourcen. Auf der anderen Seite gibt es einen strikte Trennung zwischen Kunde, Anforderungsanalyse, Entwicklung, Test und Betrieb. Ich erachte diesen Trend in Kombination mit Near- und Off-Shoring und der Idee, dass der Entwickler eine Ressource ist und damit beliebig austauschbar wird, als grosse Gefahr und Kern vieler Probleme in der heutigen Software Entwicklung. Der Vortrag soll aufzeigen, wie der moderne Software Entwickler richtig eingesetzt wird, wie man die Rolle wieder aufwertet und attraktiv macht und damit die Effizienz und Kundenzufriedenheit im ganzen Software Entwicklungszyklus massiv steigert. </p>",
      "speakerIds": [
        31
      ],
      "common": false
    },
    {
      "id": "A4",
      "title": "A4 - Künstliche Intelligenz in 40 Minuten",
      "abstract": "<p>Künstliche Intelligenz wird immer noch oft als rein akademisch fehleingeschätzt. Ihre Anwendungen dringen eher unbemerkt in wichtige produktive Bereiche vor. Dieser Vortrag bietet einen breiten Blick über das Gebiet der KI mit ihren Teilbereichen, Paradigmen und Architekturmustern. Kurz vorgestellt und abgegrenzt werden: <ul><li>Neuronale Netze vs. symbolische Modelle</li><li>Suche im Zustandsraum, Heuristik</li><li>Experten- und Planungssysteme</li><li>Induktion, Deduktion</li><li>Diagnostik</li><li>Unsicheres und nicht-monotones Schliessen</li><li>Agenten</li><li>Genetische Algorithmen</li></ul>Entwicklungen und Trends werden vorgestellt.</p>",
      "speakerIds": [
        19
      ],
      "common": false
    },
    {
      "id": "B1",
      "title": "B1 - R - The Machinery behind Machine Learning",
      "abstract": "<p>Beim PFI (Plattform für Forschung und Innovation) vom SCI ist seit über einem Jahr R intensiv im Einsatz. Wir werden bei diesem Vortrag zeigen, weshalb wir R verwenden, was R kann und wie man mit R schnell und professionelle Analysen durchführen kann.<ul><li>Im PFI eingesetzte Machine Learning Algorithmen</li><li>Tips und Tricks (R Debugging und Performance Optimierungen)</li><li>Ein paar Beispiele aus der Praxis, welche wir im PFI bearbeitet haben.</li></ul></p>",
      "speakerIds": [
        1,
        4
      ],
      "common": false
    },
    {
      "id": "B2",
      "title": "B2 - Triple Session",
      "abstract": "<p><b>Introscope News 10.2</b><br>Die SBB setzt Introscope von der Firma CA für Performancemessungen sowie Analysen in Problemfällen für Websphere Applikationen ein. Hier werden Nützliches, die Möglichkeiten von Introscope in der Cloud sowie die neuen Features der Version 10.2 vorgestellt.</p><p><b>The MEAN Machine</b><br>Der MEAN Stack besteht aus den Komponenten MongoDB, ExpressJS, AngluarJS und NodeJS. Da alle Komponenten auf JavaScript aufbauen, lässt sich Client und Server-seitig in einer Sprache und Paradigma End2End entwickeln. In dem Talk wird gezeigt, wie sich mit einfachen Schritten eine moderne MicroService basierte WebApp entwickeln lässt.</p><p><b>Das SwissPass Login für Mobile Apps</b><br>Im Rahmen von Projekt SID wurde eine neue Integrationsarchitektur für das SwissPass Login für mobile Apps auf Basis von OAuth 2.0 erarbeitet und auch umgesetzt. Diese wird im Detail vorgestellt und anhand einer Demo gezeigt, wie einfach man B2C-Apps mit dem SwissPass Login ausstatten kann.</p>",
      "speakerIds": [
        15,
        2,
        26
      ],
      "common": false
    },
    {
      "id": "B3",
      "title": "B3 - Triple Session",
      "abstract": "<p><b>UX für mobile Geschäftsanwendungen</b><br>Welchen Gewinn bringt der Einsatz von UX für mobile Geschäftsanwendungen? Am Beispiel der MobWK App für SBB Cargo zeigen wir auf, worauf man bei der Konzeption einer App für die Arbeit im Gleis achten muss. Welche Vorteile bringt dabei das benutzerzentrierte Vorgehen?</p><p><b>Continuous Testing</b><br>Kurze Vorschau wie man die HP Tool Palette (HP UFT, HP Loadrunner, HP ALM) und SOATest zusammen mit Jenkins in der Continuous Testing/Delivery Welt einbinden kann.</p><p><b>Docker and LetsEncrypt: 10mins to spawn SSL-Services</b><br>LetsEncrypt (https://letsencrypt.org) erlaubt seit Dezember letzten Jahres das automatisierte Generieren von vertrauenswürdigen, kostenlosen SSL-Zertifikaten auf Basis des ACME-Protokolls. Das manuelle, teure und teilweise auch organisatorisch mühsame Erstellen und Warten von Zertifikaten für Webseiten wird dadurch drastisch vereinfacht. In diesem Vortrag wird das Zusammenspiel von LetsEncrypt und Docker vorgestellt. Einfach und schnell wird innert 10min eine beliebig existierende Webapplikationen inklusive SSL bereitgestellt.</p>",
      "speakerIds": [
        11,
        21,
        24,
        30
      ],
      "common": false
    },
    {
      "id": "B4",
      "title": "B4 - JavaScript - Die universelle Plattform?",
      "abstract": "<p>Spätestens seit dem Siegeszug von HTML5 und modernen Single Page Application Frameworks wie Angular, React und Ember ist JavaScript die unumstrittene de-facto Programmiersprache für Web-Applikationen. Im Schatten der Browser-seitigen Programmierung hat sich JavaScript aber zu der einzigen wirklich ernstzunehmenden universellen Plattform entwickelt: Basierend auf JavaScript werden heute Desktop-Applikationen, Mobile-Apps, Backend-Services und sogar Datenbank-Lösungen realisiert. Der Vortrag zeigt anhand von Beispielen was heute mit JavaScript ausserhalb der klassischen Web-Entwicklung alles machbar ist:<ul><li>Electron für die Realisierung von Cross-Platform Desktop Applikationen</li><li>Native-Script & React-Native für die Realisierung von nativen mobilen Applikationen</li><li>Node.js für server-seitige Programmierung</li><li>Verschiedene Datenbank Lösungen mit einem JavaScript API</li></ul>Am Ende werden Überlegungen angestellt, wie mit diesen Ansätzen eine bessere Wiederverwendbarkeit von Code erreicht werden könnte.</p>",
      "speakerIds": [
        16
      ],
      "common": false
    },
    {
      "id": "C1",
      "title": "C1 - Get your applications ready for the cloud with ESTA Cloud and ESTA WebJS",
      "abstract": "<p>Bereits jetzt haben SBB Projekte die Möglichkeit Web-GUIs mit ESTA WebJS (AngularJS) zu bauen. Im Laufe dieses Jahres wir mit ESTA Cloud die Möglichkeit Backends mit Spring Boot und dem Netflix-Cloudstack dazu kommen. Dieser Vortrag zeigt diese neuen Möglichkeiten und stellt die Stacks vor und zeigt eine Demonstration am ESTA Showcase.</p>",
      "speakerIds": [
        28,
        5
      ],
      "common": false
    },
    {
      "id": "C2",
      "title": "C2 - Zehn SQL-Tricks, die du nicht für möglich gehalten hättest",
      "abstract": "<p>SQL ist die Sprache von Big Data. Egal, ob eine klassische relationale Datenbank, ein Column Store („NewSQL“) oder ein nicht relationales Speichersystem („NoSQL“) verwendet wird, eine starke, deklarative, SQL-basierte Abfragesprache verschafft den entscheidenden Vorteil. In diesem rasanten und nicht immer ganz ernst gemeinten Vortrag werden wir einige eigenartige, jedoch sehr interessante Datenprobleme anschauen und mittels SQL lösen. Schnallt euch an, und zieht euch warm an!</p>",
      "speakerIds": [
        17
      ],
      "common": false
    },
    {
      "id": "C3",
      "title": "C3 - Das Agilität - Stabilität Paradoxon (oder ist antifragil die nächste Evolutionsstufe von agil)",
      "abstract": "<p>Seit Jahrzenten haben IT Abteilungen, so auch die SBB-IT, die Betriebsstabilität als einer der wichtigsten Faktoren angesehen. Mit gutem Grund, denn instabile Applikationen kosten viel Geld, Kunden und sind auf lange Sicht sehr schädlich für die Reputation des Unternehmens. Die Grossstörungen im 2015 hatten spürbare Auswirkungen für unser Business. Mit der Digitalisierung wird die IT-Durchdringung bei der SBB weiter zunehmen. Die damit steigende IT-Abhängigkeit des Geschäfts verstärkt die Wichtigkeit der Betriebsstabilität erheblich. Welche Auswirkungen hat die Agilisierung, Cloud-Computing und DevOps auf die Stabilität? Ist es ein nicht tragbares Risiko oder ist es die Voraussetzung um in Zukunft mit der immer stärkeren durch die Digitalisierung verursachten IT-Durchdringung die Stabilität überhaupt zu gewährleisten?</p>",
      "speakerIds": [
        23,
        3
      ],
      "common": false
    },
    {
      "id": "C4",
      "title": "C4 - Vom Infrastruktur Monitoring zur proaktiven Service-Überwachung mithilfe kognitiver Intelligenz",
      "abstract": "<p>Das SBB Infrastruktur Monitoring („IMon“) basiert auf dem IBM Cloud Softwareportfolio und wird heute für das Fault-­ und IT-­Service Management eingesetzt. Wesentliche Software Komponenten im IMon-­Umfeld sind u.a. die IBM Tivoli Netcool Produkte, Datenbanken (Oracle), WebSphere Middleware, WebApplications (Java) und Business Objects. Stetig wachsende Anforderungen an die Verfügbarkeit, Performance und Kundenzufriedenheit von Business Anwendungen bei der SBB erfordern auch ein Umdenken im Fault-­ und IT-­Service Management. Es reicht nicht mehr aus, auf der Basis von Alarmlisten zu arbeiten und die einzelnen technischen Komponenten der IT Infrastruktur zu überwachen. Entscheidend ist es, die Zusammenhänge von unterschiedlichen Infrastruktur-Fehlern schnell zu realisieren – ja, sogar zu erkennen, bevor die Fehler den Kundenservice beeinträchtigen! Die notwendigen Daten, um Störungen vorhersehen zu können, liegen dabei heute bereits vor. Die Herausforderung ist, intelligent die richtigen Schlüsse aus den massiven Datenmengen zu ziehen. Dabei müssen auch Daten aus Mobile Apps, Social Media und anderen Quellen zu Rate gezogen werden.</p><p>Heute werden in der Regel die möglichen Zusammenhänge von Datenpunkten durch Fachexperten erarbeitet und den Monitoring-­Administratoren vorgeschlagen. In langwierigen Prozessen werden dann Störungsszenarien entwickelt und die entsprechenden Korrelationen in der Monitoring-­Software aufgebaut. In Zukunft wird die Software solche Zusammenhänge selbst aus den Daten erkennen und lernen. Die Erfahrung, die heute noch in den Köpfen der System Engineers verteilt ist, wird dann in das Monitoring-­Produkt wandern (müssen!). Das bietet dann die Möglichkeit, die Service-­Verfügbarkeit und –Qualität effektiv zu überwachen, das Infrastruktur-­Monitoring ist dann nur noch Mittel zum Zweck, die Arbeitsweise im Operations-­Center wird sich entsprechend verändern. IBM ist auf dem Gebiet der kognitiven Analytik seit Jahren führend und hat mit Watson ein extrem erfolgreiches Produkt geschaffen, von dem nun sehr viele andere IBM-­Produkte profitieren. IBM Netcool bietet nun die technischen Möglichkeiten, die Kunden auf dem oben beschriebenen Weg zu einem effektiven Service-­Monitoring zu begleiten.</p>",
      "speakerIds": [
        14
      ],
      "common": false
    },
    {
      "id": "D1",
      "title": "D1 - Double Session",
      "abstract": "<p><b>What is New in Angular2?</b><br>Die Referenten geben einen Ausblick auf die neue Angular2 Version. Dabei werden neue Features kurz betrachtet und einen Blick auf Angular als Applikationsplattform gegeben.</p><p><b>Swagger – RESTful Webservices sichtbar gemacht</b><br>RESTFul Webservices werden im Backend immer wichtiger. Anhand von Live-Demos wird gezeigt, wie man mit Java Technologien RESTFul Webservices definieren und diese mit Swagger sichtbar machen kann. Ein Erfahrungsbericht aus der Entwicklungsstrasse Drittgeschäft (SCP).</p>",
      "speakerIds": [
        34,
        12
      ],
      "common": false
    },
    {
      "id": "D2",
      "title": "D2 - Let it Flow: RxJava auf Android",
      "abstract": "<p>Reactive Programming ist schon seit längerem ein vieldiskutiertes Thema, welches trotzdem oder gerade deswegen noch viele Fragen aufwirft. Dieser Vortrag zeigt, wie die ursprünglich für .NET entwickelte Erweiterung des Observer-Patterns für gängige Probleme unter Android verwendet werden kann. Nach einer Einführung in die Grundlagen und Prinzipien des ‚Reactive Programming‘ und Observables, nehmen wir Themen wie die Integration mit dem Android Lifecycle und den Umgang mit dem Android Threading Model unter die Lupe. Den Abschluss bildet eine Demo-App, welche die Integration mit bekannten Bibliotheken wie z.B. Retrofit demonstriert und zeigt, wie RxJava den Entwickler-Alltag vereinfachen kann.</p>",
      "speakerIds": [
        20,
        10
      ],
      "common": false
    },
    {
      "id": "D3",
      "title": "D3 - Double Session",
      "abstract": "<p><b>Automatisierung Build und Deploymentaufgaben mit Smoothie</b><br>Das Build und Deplyoment-Team bei MVD unterstützt den Wartungsbetrieb und viele Projekte. Mit dem fortschreiten der agilen Transition steigt die Nachfrage nach Releases, Deployments und neuen Infrastrukturkomponenten laufend. Das B&D-Team bei MVD hat daher mit Smootie eine Lösung entwickelt um auf Basis des WZU-Toolstacks und der Verfahren bei IT-OM grosse Teile der regelmässig wiederkehrenden Aufgaben zu automatisieren. Zusätzlich werden mittlerweile grosse Teile der Build-und Deplyoment-Dokumentation generiert.Wir beleuchten im Vortrag die technischen Grundlagen von Smoothie, beleuchten auch kurz die Schwierigkeiten die auf dem Weg zur heutigen Lösung zu überwinden waren, und geben einen Ausblick auf die Einsatzmöglichkeiten von Smoothie in anderen Bereichen der SBB-IT.</p><p><b>Continuous Release, the missing piece</b><br>Mit den Standard CI Tools der SBB lässt sich nicht nur kontinuierlich Software builden, testen und integrieren, sondern auch automatisch releasen und liefern. Ich zeige auf wie:<ul>Das Release Train Mojo ist als Vertiefungsthema entstanden und steht auf dem SBB GIT Hub Account frei zur Verfügung.</li><li>Aufbau, Architektur und funktionen des Plugins</li><li>Entwickeln auf GITHub & den offiziellen Maven Repos</li><li>Hand’s On</li></ul></p>",
      "speakerIds": [
        18,
        9
      ],
      "common": false
    },
    {
      "id": "D4",
      "title": "D4 - IoT end to end",
      "abstract": "<p>Ein Einblick in technische Herausforderungen zu Cloud-Integration und das Internet der Dinge bei der SBB-IT. Wir zeigen, dass durch die Konvergenz bestehender Technologien aus dem Bereich Cloud, Big-Data und dem Webservice-Gateway schnell und nachhaltig eine Lösung für einen IoT Showcase realisiert werden kann.</p>",
      "speakerIds": [
        8,
        7,
        27
      ],
      "common": false
    },
    {
      "id": "E1",
      "title": "E1 - Basisservices und API Management: ein Showcase",
      "abstract": "<p>Vorstellung eines PoC auf Basis tyk (tyk.io) und des Zusammenspiels mit dem SBB Service Repository (https://confluence.sbb.ch/x/eYZIKg ). Als fachlicher Case dient eine einfache API für den Basisservice „Mitarbeiter“. Erfahrungen mit dem Produkt sowohl für Provider als auch Consumer von APIs werden aufgezeigt.</p>",
      "speakerIds": [
        36,
        38
      ],
      "common": false
    },
    {
      "id": "E2",
      "title": "E2 - Mastering the Cloud: Continuous Delivery & Self Service on OpenShift",
      "abstract": "<p>OpenShift bietet Entwicklern und Betreibern völlig neue Möglichkeiten, ihre Applikationen und Infrastrukturen zu definieren und zu steuern. In diesem Vortrag nehmen wir euch mit in die schöne neue Welt und zeigen, wie eine Anwendung in wenigen Schritten in die Cloud gebracht wird. Dabei führen wir auch durch Themen wie Continuous Delivery oder Zero-Downtime Deployments und demonstrieren, wie vordefinierte Infrastrukturkomponenten verwendet werden können.</p>",
      "speakerIds": [
        25,
        37
      ],
      "common": false
    },
    {
      "id": "E3",
      "title": "E3 - Wer plant verliert oder How I Learned to Stop Worrying and Love Complexity",
      "abstract": "<p>Jahrzehntelang haben wir versucht, mit Techniken aus dem traditionellen Ingenieurwesen Software zu entwickeln. Wir haben versucht, komplexe Probleme durch Annahmen und Analyse zu komplizierten und so planbar zu machen. Mittlerweile wissen wir, dass dieser Ansatz der Natur der Softwareentwicklung nicht gereicht wird.Aber warum eigentlich? Müssten wir nicht einfach nur besser planen? Was macht Softwareentwicklung komplex? Was heisst das? Und sind agile Vorgehensweisen wirklich die Lösung aller Probleme?</p>",
      "speakerIds": [
        13
      ],
      "common": false
    },
    {
      "id": "E4",
      "title": "E4 - Kotlin, die Sprache die Java verdrängen wird",
      "abstract": "<p>Die coolsten Kotlin Sprachfeatures anhand von Code Beispielen für (Java) Entwickler die noch nie etwas von Kotlin gehört oder gesehen haben.</p>",
      "speakerIds": [
        29
      ],
      "common": false
    },
    {
      "id": "outro",
      "title": "Abschluss Developer Day 2016",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "apero",
      "title": "Apéro",
      "abstract": "",
      "speakerIds": [],
      "common": true
    }
  ],
  "tracks": [
    {
      "id": "technologies",
      "title": "Technologies",
      "presentations": [
        {
          "id": 10,
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:05"
          },
          "roomId": "2"
        },
        {
          "id": 20,
          "talkId": "eroeffnungsrede",
          "time": {
            "start": "09:05",
            "end": "09:15"
          },
          "roomId": "2"
        },
        {
          "id": 30,
          "talkId": "keynote1",
          "time": {
            "start": "09:15",
            "end": "10:00"
          },
          "roomId": "2"
        },
        {
          "id": 40,
          "talkId": "pause",
          "time": {
            "start": "10:00",
            "end": "10:30"
          },
          "roomId": "2"
        },
        {
          "id": 200,
          "talkId": "A1",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "3"
        },
        {
          "id": 210,
          "talkId": "B1",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "3"
        },
        {
          "id": 50,
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "2"
        },
        {
          "id": 220,
          "talkId": "C1",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "4"
        },
        {
          "id": 230,
          "talkId": "D1",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "3"
        },
        {
          "id": 60,
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "2"
        },
        {
          "id": 240,
          "talkId": "E1",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "1"
        },
        {
          "id": 70,
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:35"
          },
          "roomId": "2"
        },
        {
          "id": 80,
          "talkId": "outro",
          "time": {
            "start": "16:35",
            "end": "16:40"
          },
          "roomId": "2"
        },
        {
          "id": 90,
          "talkId": "apero",
          "time": {
            "start": "16:40",
            "end": "18:15"
          },
          "roomId": "2"
        }
      ]
    },
    {
      "id": "plattforms",
      "title": "Plattforms",
      "presentations": [
        {
          "id": 10,
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:05"
          },
          "roomId": "2"
        },
        {
          "id": 20,
          "talkId": "eroeffnungsrede",
          "time": {
            "start": "09:05",
            "end": "09:15"
          },
          "roomId": "2"
        },
        {
          "id": 30,
          "talkId": "keynote1",
          "time": {
            "start": "09:15",
            "end": "10:00"
          },
          "roomId": "2"
        },
        {
          "id": 40,
          "talkId": "pause",
          "time": {
            "start": "10:00",
            "end": "10:30"
          },
          "roomId": "2"
        },
        {
          "id": 300,
          "talkId": "A2",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "4"
        },
        {
          "id": 310,
          "talkId": "B2",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "1"
        },
        {
          "id": 50,
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "2"
        },
        {
          "id": 320,
          "talkId": "C2",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "2"
        },
        {
          "id": 330,
          "talkId": "D2",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "2"
        },
        {
          "id": 60,
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "2"
        },
        {
          "id": 340,
          "talkId": "E2",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "4"
        },
        {
          "id": 70,
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:35"
          },
          "roomId": "2"
        },
        {
          "id": 80,
          "talkId": "outro",
          "time": {
            "start": "16:35",
            "end": "16:40"
          },
          "roomId": "2"
        },
        {
          "id": 90,
          "talkId": "apero",
          "time": {
            "start": "16:40",
            "end": "18:15"
          },
          "roomId": "2"
        }
      ]
    },
    {
      "id": "engineeringArts",
      "title": "Engineering Arts",
      "presentations": [
        {
          "id": 10,
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:05"
          },
          "roomId": "2"
        },
        {
          "id": 20,
          "talkId": "eroeffnungsrede",
          "time": {
            "start": "09:05",
            "end": "09:15"
          },
          "roomId": "2"
        },
        {
          "id": 30,
          "talkId": "keynote1",
          "time": {
            "start": "09:15",
            "end": "10:00"
          },
          "roomId": "2"
        },
        {
          "id": 40,
          "talkId": "pause",
          "time": {
            "start": "10:00",
            "end": "10:30"
          },
          "roomId": "2"
        },
        {
          "id": 400,
          "talkId": "A3",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "2"
        },
        {
          "id": 410,
          "talkId": "B3",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "4"
        },
        {
          "id": 50,
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "2"
        },
        {
          "id": 420,
          "talkId": "C3",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "3"
        },
        {
          "id": 430,
          "talkId": "D3",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "4"
        },
        {
          "id": 60,
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "2"
        },
        {
          "id": 440,
          "talkId": "E3",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "2"
        },
        {
          "id": 70,
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:35"
          },
          "roomId": "2"
        },
        {
          "id": 80,
          "talkId": "outro",
          "time": {
            "start": "16:35",
            "end": "16:40"
          },
          "roomId": "2"
        },
        {
          "id": 90,
          "talkId": "apero",
          "time": {
            "start": "16:40",
            "end": "18:15"
          },
          "roomId": "2"
        }
      ]
    },
    {
      "id": "beyond",
      "title": "Beyond",
      "presentations": [
        {
          "id": 10,
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:05"
          },
          "roomId": "2"
        },
        {
          "id": 20,
          "talkId": "eroeffnungsrede",
          "time": {
            "start": "09:05",
            "end": "09:15"
          },
          "roomId": "2"
        },
        {
          "id": 30,
          "talkId": "keynote1",
          "time": {
            "start": "09:15",
            "end": "10:00"
          },
          "roomId": "2"
        },
        {
          "id": 40,
          "talkId": "pause",
          "time": {
            "start": "10:00",
            "end": "10:30"
          },
          "roomId": "2"
        },
        {
          "id": 500,
          "talkId": "A4",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "1"
        },
        {
          "id": 510,
          "talkId": "B4",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "2"
        },
        {
          "id": 50,
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "2"
        },
        {
          "id": 520,
          "talkId": "C4",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "1"
        },
        {
          "id": 530,
          "talkId": "D4",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "1"
        },
        {
          "id": 60,
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "2"
        },
        {
          "id": 540,
          "talkId": "E4",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "3"
        },
        {
          "id": 70,
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:35"
          },
          "roomId": "2"
        },
        {
          "id": 80,
          "talkId": "outro",
          "time": {
            "start": "16:35",
            "end": "16:40"
          },
          "roomId": "2"
        },
        {
          "id": 90,
          "talkId": "apero",
          "time": {
            "start": "16:40",
            "end": "18:15"
          },
          "roomId": "2"
        }
      ]
    }
  ],
  "rooms": [
    {
      "id": 1,
      "name": "Falco"
    },
    {
      "id": 2,
      "name": "Pavillon"
    },
    {
      "id": 3,
      "name": "Buteo"
    },
    {
      "id": 4,
      "name": "SIBE"
    }
  ]
}
