{
  "id": 99999,
  "name": "SBB IT Developer Day 2015",
  "location": "Gurten",
  "date": "09.09.2015",
  "speakers": [
    {
      "id": 1,
      "name": "Adrian",
      "surname": "Hofer",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ah.jpg",
      "bio": ""
    },
    {
      "id": 2,
      "name": "Agim",
      "surname": "Emruli",
      "email": "",
      "company": "mimacom ag",
      "picture": "images/referenten/ae.jpg",
      "bio": ""
    },
    {
      "id": 3,
      "name": "Andreas",
      "surname": "Wieczorek",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/aw.jpg",
      "bio": ""
    },
    {
      "id": 4,
      "name": "Baltisar",
      "surname": "Oswald",
      "email": "",
      "company": "IT-AQ",
      "picture": "images/referenten/bo.jpg",
      "bio": ""
    },
    {
      "id": 5,
      "name": "Björn",
      "surname": "Mosler",
      "email": "",
      "company": "Netcetera AG",
      "picture": "images/referenten/bm.jpg",
      "bio": ""
    },
    {
      "id": 6,
      "name": "Dominik",
      "surname": "Schmucki",
      "email": "",
      "company": "IT-SCP",
      "picture": "images/referenten/ds.jpg",
      "bio": ""
    },
    {
      "id": 7,
      "name": "Eleuza",
      "surname": "Kalbermatter Mendes",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/emk.jpg",
      "bio": ""
    },
    {
      "id": 8,
      "name": "Florian",
      "surname": "Seidl",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/fs.jpg",
      "bio": ""
    },
    {
      "id": 9,
      "name": "Gilles",
      "surname": "Zimmermann",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/gz.jpg",
      "bio": ""
    },
    {
      "id": 10,
      "name": "Igor",
      "surname": "Masen",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/im.jpg",
      "bio": ""
    },
    {
      "id": 11,
      "name": "Ivan",
      "surname": "Hechmann",
      "email": "",
      "company": "IT-OM",
      "picture": "images/referenten/ih.jpg",
      "bio": ""
    },
    {
      "id": 12,
      "name": "Jamie",
      "surname": "Townsend",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/jt.jpg",
      "bio": ""
    },
    {
      "id": 13,
      "name": "Jonas",
      "surname": "Bandi",
      "email": "",
      "company": "Jonas Bandi",
      "picture": "images/referenten/jb.jpg",
      "bio": ""
    },
    {
      "id": 14,
      "name": "Kaspar",
      "surname": "Käser",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/kk.jpg",
      "bio": ""
    },
    {
      "id": 15,
      "name": "Katharina",
      "surname": "Mellert",
      "email": "",
      "company": "IT-SCF",
      "picture": "images/referenten/km.jpg",
      "bio": ""
    },
    {
      "id": 16,
      "name": "Korhan",
      "surname": "Gülseven",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/kg.jpg",
      "bio": ""
    },
    {
      "id": 17,
      "name": "Lukas",
      "surname": "Eder",
      "email": "",
      "company": "Data Geekery GmbH",
      "picture": "images/referenten/le.jpg",
      "bio": ""
    },
    {
      "id": 18,
      "name": "Lukasz",
      "surname": "Pielak",
      "email": "",
      "company": "Lukasz Pielak",
      "picture": "images/referenten/lp.jpg",
      "bio": ""
    },
    {
      "id": 19,
      "name": "Maciej",
      "surname": "Raciborski",
      "email": "",
      "company": "IT-OM",
      "picture": "images/referenten/mr.jpg",
      "bio": ""
    },
    {
      "id": 20,
      "name": "Maik",
      "surname": "Fettig",
      "email": "",
      "company": "IT-SCP",
      "picture": "images/referenten/mf.jpg",
      "bio": ""
    },
    {
      "id": 21,
      "name": "Marc",
      "surname": "Hoffmann",
      "email": "",
      "company": "mtrail GmbH",
      "picture": "images/referenten/mh.jpg",
      "bio": ""
    },
    {
      "id": 22,
      "name": "Matthias",
      "surname": "Junker",
      "email": "",
      "company": "Netcetera AG",
      "picture": "images/referenten/mj.jpg",
      "bio": ""
    },
    {
      "id": 23,
      "name": "Matthias",
      "surname": "von Rohr",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/mvr.jpg",
      "bio": ""
    },
    {
      "id": 24,
      "name": "Michael",
      "surname": "Krausse",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/mk.jpg",
      "bio": ""
    },
    {
      "id": 25,
      "name": "Peter",
      "surname": "Hirzel",
      "email": "",
      "company": "IT-SCP",
      "picture": "images/referenten/ph.jpg",
      "bio": ""
    },
    {
      "id": 26,
      "name": "Philippe",
      "surname": "Robert",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/pr.jpg",
      "bio": ""
    },
    {
      "id": 27,
      "name": "Piotr",
      "surname": "Kowol",
      "email": "",
      "company": "IT-SCF",
      "picture": "images/referenten/pk.jpg",
      "bio": ""
    },
    {
      "id": 28,
      "name": "Ramon",
      "surname": "Spahr",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/rs.jpg",
      "bio": ""
    },
    {
      "id": 29,
      "name": "Raoul",
      "surname": "Neu",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/rn.jpg",
      "bio": ""
    },
    {
      "id": 30,
      "name": "Roger",
      "surname": "Bobst",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/rb.jpg",
      "bio": ""
    },
    {
      "id": 31,
      "name": "Sebastian",
      "surname": "Graf",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/sg.jpg",
      "bio": ""
    },
    {
      "id": 32,
      "name": "Simon",
      "surname": "Butscher",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/sb.jpg",
      "bio": ""
    },
    {
      "id": 33,
      "name": "Simon",
      "surname": "Martinelli",
      "email": "",
      "company": "simas GmbH",
      "picture": "images/referenten/sm.jpg",
      "bio": ""
    },
    {
      "id": 34,
      "name": "Stefan",
      "surname": "Graf",
      "email": "",
      "company": "IT-SCF",
      "picture": "images/referenten/sg2.jpg",
      "bio": ""
    },
    {
      "id": 35,
      "name": "Stefano",
      "surname": "Trentini",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/st.jpg",
      "bio": ""
    },
    {
      "id": 36,
      "name": "Thorsten",
      "surname": "Löhndorf",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/tl.jpg",
      "bio": ""
    },
    {
      "id": 37,
      "name": "Tobias",
      "surname": "Denzler",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/td.jpg",
      "bio": ""
    },
    {
      "id": 38,
      "name": "Tobias",
      "surname": "Röthlisberger",
      "email": "",
      "company": "IT-AQ",
      "picture": "images/referenten/tr.jpg",
      "bio": ""
    },
    {
      "id": 39,
      "name": "Werner",
      "surname": "Perret",
      "email": "",
      "company": "IT-SCP",
      "picture": "images/referenten/wp.jpg",
      "bio": ""
    }
  ],
  "talks": [
    {
      "id": "intro",
      "title": "Intro und Begrüssung",
      "abstract": "",
      "speakerIds": [35],
      "common": true
    },
    {
      "id": "keynote1",
      "title": "Keynote 1 - Continuous Innovation mit Open-Source",
      "abstract": "<p>Open-Source hat sich von einer kostengünstigen Alternative zum Innovationsmotor in der Softwareindustrie gewandelt. Firmen nutzen Open-Source Technologien um selbst innovativ am Markt zu sein oder ganze Geschäftsmodelle neu zu erfinden.</p><p>Die Keynote zeigt wie Open-Source disruptive sowie kontinuierliche Innovationen auf Basis von breiten communities liefert.</p>",
      "speakerIds": [2],
      "common": true
    },
    {
      "id": "keynote2",
      "title": "Keynote 2 - Beyond Technology: Care, Act, Communicate",
      "abstract": "<p>Unsere primäre Aufgabe als Softwareentwickler ist es, mit geeigneten Technologien und Werkzeugen Projekte zum Erfolg zu führen. Meist hängt der Projekterfolg – und leider manchmal auch Misserfolg – jedoch ganz entscheidend von nicht-technischen Faktoren ab. Was sind diese nicht-technischen Erfolgsfaktoren? Und vor allem: Wie können wir als Softwareingenieure diese Faktoren selber in die Hand nehmen?</p><p>Die Keynote versteht sich als Aufforderung an alle technischen Projektmitarbeiter, auch auf die nicht-technischen Aspekte ein Augenmerk zu richten und damit aktiv zum Projekterfolg beizutragen.</p>",
      "speakerIds": [21],
      "common": true
    },
    {
      "id": "keynotemini",
      "title": "Mini Keynote  - Agile meets Management",
      "abstract": "<p>Die immer wieder gern gestellte Frage 'Weiss das Management überhaupt, was wir hier machen' soll in diesem Vortrag beantwortet werden. Nebenbei erzähle ich, was wir uns agilen Transformationsprogramm der SBB IT für die nächsten Jahre vorgenommen haben. Dabei werden wir eine Reihe von Verbesserungen in kleinen Schritten einführen. In meinem kurzen Vortrag werde ich Themen wie Continuous Delivery und DevOps streifen und Werbung machen für die aktive Teilnahme in der neuen agilen Community of Practice.</p>",
      "speakerIds": [36],
      "common": true
    },
    {
      "id": "pause",
      "title": "Pause",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "mittagessen",
      "title": "Mittagessen",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "A1",
      "title": "A1 – SAP UI Technologien - Alles wird gut?",
      "abstract": "<p>SAP hat in den letzten Monaten/Jahren eine grosse Offensive gestartet bezüglich Usability und User Experience. Dazu gehören viele neue UI-Technologien (Programmiersprachen wie auch GUIs), die das Erscheinungsbild und die Integrationsfähigkeit von verschiedenen Oberflächen nachhaltig verändern. Mit dem Vortrag soll aufgezeigt werden, wie die UI Strategie von SAP aussieht und wo sich die SBB IT auf diesem Weg befindet. Welche Technologien, Frontends stehen im Fokus und was sind die aktuellen Schwierigkeiten diesbezüglich bei der SBB IT.</p>",
      "speakerIds": [34],
      "common": false
    },
    {
      "id": "A2",
      "title": "A2 - Unix - (M)eine Liebeserklärung",
      "abstract": "<p>Seitdem ich in der IT Industrie arbeite, hatte ich zahlreiche Affären. Programmiersprachen, Datenbanken, Frameworks und Browser kamen und gingen. Nur mein Betriebssystem – Unix -  hat mich nie enttäuscht. Zeit mich zu revangieren und in 40 Minuten, eine Unix-Einführung zu geben. Insbesondere möchte ich zeigen, warum sich Unix unter anderem so hervoragend für Automatisierung einfacher Tätigkeiten eignet.</p>",
      "speakerIds": [24],
      "common": false
    },
    {
      "id": "A3",
      "title": "A3 - Continuous Delivery und DevOps - Theorie und Praxis",
      "abstract": "<p>Durch die Einführung von agilen Methoden in der Softwareentwicklung werden regelmässig neue Software-Releases produziert. Aber wie bringen wir diese möglichst rasch, in guter Qualität und ohne Nebenwirkungen in Produktion? Continuous Delivery und DevOps werden in diesem Zusammenhang oft genannt. Was steckt hinter diesen Begriffen und wie können diese in der Praxis gewinnbringend eingesetzt werden?</p><p>Der Vortrag geht kurz auf die Theorie ein, welche Rahmenbedingungen erforderlich sind und zeigt  anhand eines aktuellen Projekts aus dem Grosshandel welchen Nutzen Continuous Delivery und DevOps in der Praxis haben.</p>",
      "speakerIds": [33],
      "common": false
    },
    {
      "id": "A4",
      "title": "A4 - Making data big - Einführung in die BigData Analytik Platform",
      "abstract": "<p>Ab Sommer 2015 steht eine konzernweit nutzbare Big Data Analytik Plattform zur Verfügung. Diese Plattform wird Ausgangsbasis für innovative Entwicklungen sein, indem sie wertvolle und umfassende Datenbestände der SBB wie bspw. Mess-, Sensor- und Logdaten kosteneffizient für aktuelle oder künftige rechenintensive Analysen nutzbar macht. Beispiele solcher innovativen Entwicklungen sind Echtzeitprognosen im öffentlichen Verkehr oder prädiktive Instandhaltung von festen und rollenden Anlagen. Wir stellen die Architektur vor und geben einen Überblick über Technologien wie Hadoop und SAP HANA. Anhand laufender Projekte zeigen wir, welche Vorteile und Herausforderungen sich für Entwicklung und Modellierung von Lösungen ergeben und welchen Nutzen das Business aus den neuen Technologien ziehen kann.</p><p>Zusammen mit „Big Data“ ist auch „Advanced Analytics“ wieder zum Thema geworden. Wir zeigen hands-on, wie man mit statistischen Analysen und Machine Learning auf grossen und kleinen Datenmengen Arbeitsabläufe unterstützen und neue Insights gewinnen kann.</p>",
      "speakerIds": [
        15,
        23,
        27
      ],
      "common": false
    },
    {
      "id": "B1",
      "title": "B1 - Einführung in TypeScript",
      "abstract": "<p>TypeScript ist eine Web-Programmiersprache, welche von Microsoft entwickelt und 2012 veröffentlicht wurde. TypeScript wurde spezifisch für die Entwicklung von komplexen und grossen JavaScript-Applikationen geschaffen. Die Verbreitung von TypeScript hat sich bisher auf einige Nischen der Web-Entwicklung (v.a. im .NET Umfeld) beschränkt.</p><p>Die Verbreitung und Bedeutung von TypeScript wird sich aber voraussichtlich in naher Zukunft ändern: Die nächste Version von Angular ist nicht in JavaScript sondern in TypeScript geschrieben und TypeScript wird auch die empfohlene Sprache sein um Applikationen mit Angular 2 zu realisieren. Dieser Entscheid des Angular Teams wird dazu führen, dass TypeScript eine zentralerer Rolle ind er Web Entwicklung v.a. auch bei Enterprise Applikationen einnehmen wird.</p><p>Das Ziel von TypeScript ist es die Stärken des JavaScript Ecosystems (weite Verbreitung, vorhandene Libraries und Tools ...) zu nutzen und gleichzeitig die Schwächen von JavaScript als Sprache (schwache Typisierung, fehlende OO Konstrukte ...) zu minimieren.</p><p>TypeScript ist ein striktes Superset von JavaScript, somit jeder JavaScript-Code immer auch gültiger TypeScript-Code und bestehende JavaScript Libraries funktionieren ohne weiteres mit TypeScript. TypeScript erweitert jedoch den JavaScript-Syntax mit optionaler Typisierung und zusätzlichen OO-Konstrukten.</p><p>Der Vortrag stellt TypeScript als Sprache vor und zeigt wie man TypeScript in den Workflow für Web-Entwicklung einbindet. Der Vortrag besteht zu einem grossen Teil aus Demos und Beispielen.</p>",
      "speakerIds": [13],
      "common": false
    },
    {
      "id": "B2",
      "title": "B2 - Docker@WZU - A Fairytale in Technology",
      "abstract": "<p>Docker hat die IT-Industrie so stark beeinflusst wie kaum eine andere in den letzten 25 Jahren. Innerhalb von gerade einmal 2.5 Jahren entwickelte sich die Containertechnologie zu einem der Kernthemen in der Cloud. Docker wird die IT revolutionieren und damit auch die Art wie wir Anwendungen entwickeln, releasen und betreiben. Mit dieser Technologie hat auch bei WZU eine kleine Revolution stattgefunden. In diesem Vortrag möchten wir euch darüber berichten: <ul><li>Welche Use-Cases sich bei WZU für den Einsatz anbieten</li><li>Wie alles angefangen hat, was gut lief und wo wir Rückschläge erlitten haben</li><li>Wo wir heute stehen und was wir optimiert haben</li><li>Vorläufiges Fazit und Ausblick auf unsere nächste Schritte</li></ul></p>",
      "speakerIds": [
        30,
        10
      ],
      "common": false
    },
    {
      "id": "B3",
      "title": "B3 - WCMS Cont. Delivered",
      "abstract": "<p>Bei WCMS verlangt das Business mehrere Release pro Jahr. Ein automatisiertes, auf Ansible basiertes Deployment reduziert die manuellen Tasks erheblich und erhöht zusätzlich die Releasequalität pro Server.</p><p>In diesem Vortrag wollen wir die technischen Komponenten der automatisierten Releases bis auf Prod vorstellen. Jenkins und Ansible führen dabei Tests und Deployments in einer fix definierten Choreographie durch. Verschiedene Checks werden innerhalb der verschiedenen Staging-Instanzen durchgeführt und resultieren in weiteren Deyploments auf den nachfolgenden Instanzen. Das Wiederverwerten der Automatismen für Dev /Test / Int / Prod garantiert Reproduzierbarkeit und Skalierbarkeit, womit letztendlich Kosten gespart werden. In dem Vortrag wollen wir euch sowohl dieses Zusammenspiel der Services anhand eines Beispieldeployments vorstellen.</p>",
      "speakerIds": [
        25,
        20,
        31
      ],
      "common": false
    },
    {
      "id": "B4",
      "title": "B4 - Hazelcast. Eine Einführung in das In-Memory Data Grid und 2 Beispiele aus dessen praktischen Verwendung bei der SBB Informatik",
      "abstract": "<p>Hazelcast ist ein In-Memory Data Grid auf Basis von Java. Es ist vielseitig und kann für unterschiedlichste Use Cases wie Caching, Messaging und Distributed Computing eingesetzt werden. Dank seiner Einfachheit und den flexiblen Lizenzierungsmodellen erfreut sich das Produkt zunehmender Verbreitung, auch bei der SBB Informatik. Der Vortrag gibt eine Einführung in die Features und Funktionsweisen von Hazelcast und zeigt, wie das Produkt in zwei SCI-Vorhaben eingesetzt wird und welche Erfahrungen gewonnen werden konnten</p>",
      "speakerIds": [
        28,
        16
      ],
      "common": false
    },
    {
      "id": "C1",
      "title": "C1 - JavaScript-Tooling für Builds, Tests und Bereitstellung von Libs",
      "abstract": "<p>Basis des Vortrags ist das Vertiefungsthema  „JC16 JavaScript - Teil 2: Tooling und Client Server Kommunikation“. Ziel war: Herauszufinden ob eigene JavaScript Libraries automatisiert und getestet anderen Projekten zur Verfügung gestellt werden können. Dieser Ablauf soll in die bestehende Build-Infrastruktur der SBB integrieren werden können. Durch die Erarbeitung der Themen: Dependency Management, Automatische Browser Tests, Continous Integration und Client-Server Kommunikation mit Fokus auf die ESTA Integration kamen wir dem Ziel näher. Erarbeitete Themen und Ergebnisse werden vorgestellt.</p>",
      "speakerIds": [1],
      "common": false
    },
    {
      "id": "C2",
      "title": "C2 - Den Elefanten schneiden - der Weg zu Microservices",
      "abstract": "<p>Dieser Vortrag knüpft an meinen Vortrag von letzten Developer Day (Next Generation Enterprise Application Plattforms) an. Wie in jenem Vortrag angedeutet sehe ich die Zukunft der Entwicklung von Enterpriseanwendungen in einer Microservicearchitektur.</p><p>Was konkret ist eine Microservice? Was für Probleme löst eine solche Architektur, welche neuen Herausforderungen bringt sie mit? Wie müssen wir unsere Softwarearchitekturen gestalten, wie können wir die Betreibbarkeit sicherstellen? Wie die vielen Schnittstellen in den Griff bekommen?</p>",
      "speakerIds": [8],
      "common": false
    },
    {
      "id": "C3",
      "title": "C3 - Triple Session",
      "abstract": "<p><b>Jira-Integration in IDE (Eclipse + IntelliJ)</b><br>Habt ihr euch auch schon gefragt, warum die Logik im Code so ist, wie sie ist? In den Scrum-Teams mit physischem Scrum-Board ist die Nachvollziehbarkeit von implementiertem Code zur Story eher schwierig bzw., nur durch klare Commit-Kommentare zu bewerkstelligen. Bei der Verwendung des Scrumboards in JIRA bieten die Tools von Atlassian gute Unterstützung für die Verknüpfung zwischen Stories und Code (was aber kein Ersatz für klare Commit-Kommentare sein soll). In einer Kurzdemo zeigen wir Konfiguration und Workflow der Jira-Integration in Eclipse und IntelliJ. Wir vermuten, dass das Wissen um diese Integration nicht sehr verbreitet ist, sie die Entwickler bei der Arbeit aber gut unterstützen kann. Weitere mögliche Themen: Smart Commits in Jira, Stash Transition Triggering (falls aktiviert bis dann), Hintergrundinfos (Link zu SVN via Fisheye)</p><p><b>Effizientes Arbeiten mit IntelliJ</b><br>Anhand von kleinen Beispielen wird aufgezeigt, wie häufige Tätigkeiten eines Entwicklers mit IntelliJ effizienter erledigt werden können.</p><p><b>Babun - A Windows Shell you will love!</b><br>Die Unix-Konsole ist eines der wichtigsten Werkzeuge für Entwickler, die auf einem Mac oder Linux arbeiten. Entwickler, die Windows verwenden kennen die Unix-Konsole entweder nicht, oder unterschätzen die Dinge, die mit ihr möglich sind. In dieser kurzen Session werde ich eine kurze Präsentation über 'Babun – a linux console for Windows' geben.</p>",
      "speakerIds": [
        14,
        37,
        18
      ],
      "common": false
    },
    {
      "id": "C4",
      "title": "C4 - Stairway to Heaven: Kleine oder grosse Schritte in die Cloud?",
      "abstract": "<p>Mit VIAS steht ab 3Q2015 eine Cloud-Plattform für die SBB IT zur Verfügung. Wie wirkt sich dieses neue Betriebsmodell auf Entwicklung und Anwendungsbetrieb aus? Welche bisherigen Plattformen (WAS, Oracle, WMQ, ...) findet man unter VIAS wieder, welche Plattformen kommen neu dazu?</p><p>In der Positionierung wird zwischen dem Betrieb bestehender Anwendungen und der Entwicklung neuer Anwendungen unterschieden. Ziel des Vortrages ist es, einen Überblick über die (Zwischen-)Resultate des Projekts Cloud@SBB zu geben und die Optionen für neue Wege in der Software Entwicklung, in der Software Architektur und im Technologiemanagement aufzuzeigen: Leichtgewichtige Plattformen, MicroServices, Container-basiertes Deployment, Self-service Portal, etc.</p>",
      "speakerIds": [38],
      "common": false
    },
    {
      "id": "D1",
      "title": "D1 - ES6/Angular2/Tilestache/Docker: Erfahrungen aus dem Projekt ZPS",
      "abstract": "<p><b>Einführung Projekt ZPS + Demo NOVA-Pflege (10')</b><br>Beschreibung Projekt und Umfeld, Demo des Kartenbasierten Pflege-Frontends.</p><p><b>ES6/Angular 2 schon heute (15')</b><br>Unter anderem sollen folgende Fragen beantwortet werden:<ul><li>Warum jetzt schon umsteigen auf ES6/Angular 2?</li><li>Wie entwickelt man heute schon mit ES6/Angular 2, obwohl die Browserunterstützung noch nicht vorhanden ist?</li></ul></p><p><b>Leichtgewichtige Map-Tiles-Server Lösung mit Docker (5')</b><br>Auf der Suche nach Alternativen zu schweren GIS-Lösungen haben wir uns für ein dockerisiertes Setup mit Tilestache und Mapnik entschieden, welches Karten-Tiles basierend auf GeoJSON-Daten rendert. Dieser Themenblock soll unsere Lösung vorstellen.</p><p><b>Automatisierte Datenbankmigration mit Flyway auf mehreren Umgebungen im Continuous-Delivery-Modus (10')</b><br>Eine Herausforderung im Projekt ist die Arbeit am Datenmodell, da dieses von zwei Subprojekten verwendet wird. Zudem existieren für unterschiedliche Sprint mehrere Umgebungen. Um effizient arbeiten zu können setzt dies voraus, dass Datenmigrationen und Schemaanpassungen automatisiert ablaufen. Dazu wird Flyway eingesetzt.</p>",
      "speakerIds": [
        22,
        5
      ],
      "common": false
    },
    {
      "id": "D2",
      "title": "D2 - Demo von Cloud@SBB",
      "abstract": "<p>Cloud-Plattformen erlauben neue Wege in der Software Entwicklung und in der Software Architektur zu beschreiten. Microservice Architekturen fordern und fördern agile Organisationen optimal. Doch wie sieht es bei der SBB mit der aktuellen Cloud-Plattform aus? Welche als natürlich angesehenen Funktionen einer Cloud-Plattform sind bei der Plattform der SBB vorhanden, und wie wurde das technisch realisiert? Was können wir in Zukunft von der Cloud-Plattform der SBB erwarten? Fragen die Antworten verlangen und deren Antworten anhand einer Demo visualisiert werden.</p>",
      "speakerIds": [
        4,
        9
      ],
      "common": false
    },
    {
      "id": "D3",
      "title": "D3 - Agile Acceptance-Test-Automation with every Sprint. Our pain is your gain.",
      "abstract": "<p>Ein Tester begann die Testautomation der Xrail-Schnittstelle mit SoapUI, doch nach 10 Sprints kam er an seine Grenzen. Die Entwickler halfen ihm weiter, doch nach 5 Sprints kamen wir an die Grenzen von SoapUI. Heute haben wir alle Umsysteme an den Schnittstellen simuliert und für jeden Testcase existiert die passende Testdaten-Exceldatei. Wir können alles lokal oder in den Testumgebungen mit Jenkins laufen lassen. Die Ergebnisse des VT „SoapUI-Einsatz bei SBB für ESTA-Templateanwendung“ fliessen hier ebenso ein wie unsere Grenzerfahrungen mit SoapUI.</p><p>Wir hatten unerwartete positive Nebeneffekte, andere Dinge haben sich unangenehm manifestiert. Im Vortrag zeigen wir Euch unsere best practices und in welche Fallen wir gestolpert sind, wie wir wieder herausgekommen sind oder wieso wir immer noch in der Falle stecken.</p>",
      "speakerIds": [
        7,
        3
      ],
      "common": false
    },
    {
      "id": "D4",
      "title": "D4 - Live Hacking: Einführung in Gradle",
      "abstract": "<p>Wir wollen in dieser Session eine kurzweilige Einführung, verpackt als Live Hacking, in Gradle geben. Dabei sollen die grundlegenden Konzepte und Begriffe von Gradle anhand von Beispielen demonstriert werden. Dazu zählen unter anderem: Aufbau der Projektstruktur, der Lifecycle, Verwendung von Plugins, Arten von Dependency-Management, der ominöse Gradle Wrapper, etwas Groovy und die Migration von bestehenden Projekten.</p>",
      "speakerIds": [
        6,
        32
      ],
      "common": false
    },
    {
      "id": "E1",
      "title": "E1 - Die Entwicklung von nativen Apps (iOS) in der SBB",
      "abstract": "<p>Die Möglichkeiten der mobilen Geräte entwickeln sich rasant, das betrifft auch die Software Entwicklung selber. Es wird ein Überblick darüber gegeben wie in der SBB heute native iOS Apps entwickelt werden. Welche Hilfsmittel, Tools und Konzepte stehen zur Verfügung, wo liegen die aktuellen Herausforderungen und in welche Richtung könnte es weiter gehen?</p>",
      "speakerIds": [26],
      "common": false
    },
    {
      "id": "E2",
      "title": "E2 - Tripel Session",
      "abstract": "<p><b>Ansible im Multiplattform Bereich und die Integration in die Toollandschaft von SWE</b><br>Workflow eines mit Ansible gesteuerten Deployments sowie die Einbindung der Umsysteme aufzeigen.</p><p><b>Automatisierung im IBM Integration Bus 9</b><br>Im Rahmen des Plattformaufbaus IIB 9 wird eine komplette Übergabe- und Deploymentautomatisierung implementiert. Daraus ergeben sich nicht nur Verbesserungen im Bereich der Deploymentqualität und Abbildbarkeit auf die einzelnen Plattformausprägungen, sondern auch Anpassungen der IIB Deployment- und Betriebsprozesse, in denen die aktuell allerorts diskutierten Grundsätze von DevOps konkret Anwendung finden.</p><p><b>Integrationsressourcenengpass - Agile Plattform-Entwicklung mit festen Teams</b><br>Immer vermehrt wird IBM Integration Bus (a.k.a WebSphere Message Broker) für Integrationslösungen eingesetzt. Erfahrenen Ressourcen sind bei der SBB sehr knapp und auf dem Markt kaum zu finden. Präsentiert wird das neue Kanban-basierte Vorgehen für Projektberatung, -realisierung und -wartung sowie das proaktive Monitoring von Anwendungen. Die Unterschiede zum traditionellen Ressourcenbestellungen werden unter der Lupe genommen und die Vor- und Nachteile von Werk-Bestellungen diskutiert.</p>",
      "speakerIds": [
        11,
        19,
        12
      ],
      "common": false
    },
    {
      "id": "E3",
      "title": "E3 - SBB Mobile vNext als Pilotprojekt für SpringBoot, Cloud@SBB, Microservices",
      "abstract": "<p>SBB Mobile vNext als Pilotprojekt für SpringBoot, Cloud@SBB, Microservices</p>",
      "speakerIds": [
        29,
        4
      ],
      "common": false
    },
    {
      "id": "E4",
      "title": "E4 - 2000 Zeilen Java? Oder 50 Zeilen SQL? Die Wahl liegt bei Dir",
      "abstract": "<p>In diesem Vortrag möchte ich aufzeigen, wie viel Funktionalität man sich entgehen lässt, wenn man nicht wirklich SQL schreibt. Wenn man nicht die neusten SQL Standardentwicklungen nutzt, wie zum Beispiel SQL:1999 hierarchisches SQL, SQL:2003 Fensterfunktionen, oder viele herstellerspezifische Erweiterungen. In einer Beispielsession werden wir uns anschauen, wie man ein Running Total (einen laufenden Kontostand) über mittelgrosse Datensätze berechnet, und zwar mittels:<ul><li>Verschachtelten Selects</li><li>Fensterfunktionen</li><li>Hierarchischem SQL</li><li>Oracle MODEL Klausel</li><li>Stored Functions</li></ul></p>",
      "speakerIds": [17],
      "common": false
    },
    {
      "id": "outro",
      "title": "Abschluss Developer Day 2015",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "apero",
      "title": "Apéro",
      "abstract": "",
      "speakerIds": [],
      "common": true
    }
  ],
  "tracks": [
    {
      "id": "technologies2",
      "title": "Technologies 2",
      "presentations": [
        {
          "id": 10,
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:10"
          },
          "roomId": "2"
        },
        {
          "id": 20,
          "talkId": "keynote1",
          "time": {
            "start": "09:10",
            "end": "10:00"
          },
          "roomId": "2"
        },
        {
          "id": 30,
          "talkId": "keynotemini",
          "time": {
            "start": "10:00",
            "end": "10:10"
          },
          "roomId": "2"
        },
        {
          "id": 40,
          "talkId": "pause",
          "time": {
            "start": "10:10",
            "end": "10:30"
          },
          "roomId": "2"
        },
        {
          "id": 200,
          "talkId": "A1",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "1"
        },
        {
          "id": 210,
          "talkId": "B1",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "3"
        },
        {
          "id": 50,
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "2"
        },
        {
          "id": 220,
          "talkId": "C1",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "1"
        },
        {
          "id": 230,
          "talkId": "D1",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "2"
        },
        {
          "id": 60,
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "2"
        },
        {
          "id": 240,
          "talkId": "E1",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "4"
        },
        {
          "id": 70,
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:35"
          },
          "roomId": "2"
        },
        {
          "id": 80,
          "talkId": "outro",
          "time": {
            "start": "16:35",
            "end": "16:45"
          },
          "roomId": "2"
        },
        {
          "id": 90,
          "talkId": "apero",
          "time": {
            "start": "16:45",
            "end": "18:45"
          },
          "roomId": "2"
        }
      ]
    },
    {
      "id": "plattforms",
      "title": "Plattforms",
      "presentations": [
        {
          "id": 10,
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:10"
          },
          "roomId": "2"
        },
        {
          "id": 20,
          "talkId": "keynote1",
          "time": {
            "start": "09:10",
            "end": "10:00"
          },
          "roomId": "2"
        },
        {
          "id": 30,
          "talkId": "keynotemini",
          "time": {
            "start": "10:00",
            "end": "10:10"
          },
          "roomId": "2"
        },
        {
          "id": 40,
          "talkId": "pause",
          "time": {
            "start": "10:10",
            "end": "10:30"
          },
          "roomId": "2"
        },
        {
          "id": 300,
          "talkId": "A2",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "1"
        },
        {
          "id": 310,
          "talkId": "B2",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "3"
        },
        {
          "id": 50,
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "2"
        },
        {
          "id": 320,
          "talkId": "C2",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "1"
        },
        {
          "id": 330,
          "talkId": "D2",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "2"
        },
        {
          "id": 60,
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "2"
        },
        {
          "id": 340,
          "talkId": "E2",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "4"
        },
        {
          "id": 70,
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:35"
          },
          "roomId": "2"
        },
        {
          "id": 80,
          "talkId": "outro",
          "time": {
            "start": "16:35",
            "end": "16:45"
          },
          "roomId": "2"
        },
        {
          "id": 90,
          "talkId": "apero",
          "time": {
            "start": "16:45",
            "end": "18:45"
          },
          "roomId": "2"
        }
      ]
    },
    {
      "id": "engineeringArts",
      "title": "Engineering Arts",
      "presentations": [
        {
          "id": 10,
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:10"
          },
          "roomId": "2"
        },
        {
          "id": 20,
          "talkId": "keynote1",
          "time": {
            "start": "09:10",
            "end": "10:00"
          },
          "roomId": "2"
        },
        {
          "id": 30,
          "talkId": "keynotemini",
          "time": {
            "start": "10:00",
            "end": "10:10"
          },
          "roomId": "2"
        },
        {
          "id": 40,
          "talkId": "pause",
          "time": {
            "start": "10:10",
            "end": "10:30"
          },
          "roomId": "2"
        },
        {
          "id": 400,
          "talkId": "A3",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "1"
        },
        {
          "id": 410,
          "talkId": "B3",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "3"
        },
        {
          "id": 50,
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "2"
        },
        {
          "id": 420,
          "talkId": "C3",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "1"
        },
        {
          "id": 430,
          "talkId": "D3",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "2"
        },
        {
          "id": 60,
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "2"
        },
        {
          "id": 440,
          "talkId": "E3",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "4"
        },
        {
          "id": 70,
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:35"
          },
          "roomId": "2"
        },
        {
          "id": 80,
          "talkId": "outro",
          "time": {
            "start": "16:35",
            "end": "16:45"
          },
          "roomId": "2"
        },
        {
          "id": 90,
          "talkId": "apero",
          "time": {
            "start": "16:45",
            "end": "18:45"
          },
          "roomId": "2"
        }
      ]
    },
    {
      "id": "technologies1",
      "title": "Technologies 1",
      "presentations": [
        {
          "id": 10,
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:10"
          },
          "roomId": "2"
        },
        {
          "id": 20,
          "talkId": "keynote1",
          "time": {
            "start": "09:10",
            "end": "10:00"
          },
          "roomId": "2"
        },
        {
          "id": 30,
          "talkId": "keynotemini",
          "time": {
            "start": "10:00",
            "end": "10:10"
          },
          "roomId": "2"
        },
        {
          "id": 40,
          "talkId": "pause",
          "time": {
            "start": "10:10",
            "end": "10:30"
          },
          "roomId": "2"
        },
        {
          "id": 500,
          "talkId": "A4",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "1"
        },
        {
          "id": 510,
          "talkId": "B4",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "3"
        },
        {
          "id": 50,
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "2"
        },
        {
          "id": 520,
          "talkId": "C4",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "1"
        },
        {
          "id": 530,
          "talkId": "D4",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "2"
        },
        {
          "id": 60,
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "2"
        },
        {
          "id": 540,
          "talkId": "E4",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "4"
        },
        {
          "id": 70,
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:35"
          },
          "roomId": "2"
        },
        {
          "id": 80,
          "talkId": "outro",
          "time": {
            "start": "16:35",
            "end": "16:45"
          },
          "roomId": "2"
        },
        {
          "id": 90,
          "talkId": "apero",
          "time": {
            "start": "16:45",
            "end": "18:45"
          },
          "roomId": "2"
        }
      ]
    }
  ],
  "rooms": [
    {
      "id": 1,
      "name": "Falco (TODO)"
    },
    {
      "id": 2,
      "name": "Pavillon (TODO)"
    },
    {
      "id": 3,
      "name": "Buteo (TODO)"
    },
    {
      "id": 4,
      "name": "Fringilla (TODO)"
    },
    {
      "id": 5,
      "name": "Cuculus (TODO)"
    }
  ]
}
