{
  "id": 99999,
  "name": "SBB IT Developer Day 2017",
  "location": "Gurten",
  "date": "07.09.2016",
  "speakers": [
    {
      "id": 1,
      "name": "Alina",
      "surname": "Mylka",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/am.jpg",
      "bio": ""
    },
    {
      "id": 2,
      "name": "Andres",
      "surname": "Almiray",
      "email": "",
      "company": "Canoo Engineering AG",
      "picture": "images/referenten/aa.jpg",
      "bio": ""
    },
    {
      "id": 3,
      "name": "Cédric",
      "surname": "Lavanchy",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/cl.jpg",
      "bio": ""
    },
    {
      "id": 4,
      "name": "Christoph",
      "surname": "Bühlmann",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/cb.jpg",
      "bio": ""
    },
    {
      "id": 5,
      "name": "Claude-Alain",
      "surname": "Brohy",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/cab.jpg",
      "bio": ""
    },
    {
      "id": 6,
      "name": "Da(gile)niel",
      "surname": "Marthaler",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/dm.jpg",
      "bio": ""
    },
    {
      "id": 7,
      "name": "Erwann",
      "surname": "Wernli",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ew.jpg",
      "bio": ""
    },
    {
      "id": 8,
      "name": "Florian",
      "surname": "Seidl",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/fs.jpg",
      "bio": ""
    },
    {
      "id": 9,
      "name": "Gilles",
      "surname": "Zimmermann",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/gz.jpg",
      "bio": ""
    },
    {
      "id": 10,
      "name": "Hannes",
      "surname": "Gassert",
      "email": "",
      "company": "Liip",
      "picture": "images/referenten/hg.jpg",
      "bio": ""
    },
    {
      "id": 11,
      "name": "Igor",
      "surname": "Masen",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/im.jpg",
      "bio": ""
    },
    {
      "id": 12,
      "name": "Ilir",
      "surname": "Fetai",
      "email": "",
      "company": "IT-DA",
      "picture": "images/referenten/if.jpg",
      "bio": ""
    },
    {
      "id": 13,
      "name": "Janne",
      "surname": "Hyötylä",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/jh.jpg",
      "bio": ""
    },
    {
      "id": 14,
      "name": "Jonas",
      "surname": "Bandi",
      "email": "",
      "company": "jonasbandi.net",
      "picture": "images/referenten/jb.jpg",
      "bio": "Jonas Bandi hat 15 Jahre Erfahrung als Entwickler in Enterprise-Projekten. Aktuell arbeitet er als Freelancer in verschiedenen Entwicklungs- und Beratungsmandaten mit dem Fokus auf der Realisierung von komplexen Web-Applikationen. Daneben unterrichtet er seit 9 Jahren an der Berner Fachhochschule, unteranderem im CAS 'Applikationsentwicklung mit JavaScript & HTML5'. In den letzen Jahren hat er ausserdem viele InHouse-Kurse und Coachings für moderene Webentwicklung und AngularJS im Enterprise Umfeld durchgeführt."
    },
    {
      "id": 15,
      "name": "Kevin",
      "surname": "Kreuzer",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/kk.jpg",
      "bio": ""
    },
    {
      "id": 16,
      "name": "Lorenz",
      "surname": "Meyer",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/lm.jpg",
      "bio": ""
    },
    {
      "id": 17,
      "name": "Manuell",
      "surname": "Wallrapp",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/mw.jpg",
      "bio": ""
    },
    {
      "id": 18,
      "name": "Michael",
      "surname": "Fetzer",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/mf.jpg",
      "bio": ""
    },
    {
      "id": 19,
      "name": "Michael",
      "surname": "Krausse",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/mk.jpg",
      "bio": ""
    },
    {
      "id": 20,
      "name": "Michael",
      "surname": "Moor",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/mm.jpg",
      "bio": ""
    },
    {
      "id": 21,
      "name": "Michael",
      "surname": "Rothenbühler",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/mr.jpg",
      "bio": ""
    },
    {
      "id": 22,
      "name": "Neil",
      "surname": "Stevenson",
      "email": "",
      "company": "Hazelcast",
      "picture": "images/referenten/ns.jpg",
      "bio": ""
    },
    {
      "id": 23,
      "name": "Nima",
      "surname": "Riahi",
      "email": "",
      "company": "IT-SCF",
      "picture": "images/referenten/nr.jpg",
      "bio": ""
    },
    {
      "id": 24,
      "name": "Philipp",
      "surname": "Oser",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/po.jpg",
      "bio": ""
    },
    {
      "id": 25,
      "name": "Reto",
      "surname": "Lehmann",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/rl.jpg",
      "bio": ""
    },
    {
      "id": 26,
      "name": "Sebastian",
      "surname": "Graf",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/sg.jpg",
      "bio": ""
    },
    {
      "id": 27,
      "name": "Simon",
      "surname": "Martinelli",
      "email": "",
      "company": "72 Services GmbH",
      "picture": "images/referenten/sm.jpg",
      "bio": "Simon Martinelli ist Geschäftsführer der 72 Services GmbH und als Software Architekt, Entwickler, Berater und Trainer im Java EE Umfeld tätig.  Er verfügt über 20 Jahre Erfahrung in der Software Entwicklung in verschiedenen Rollen in Projekten unterschiedlicher Grösse. Durch seine Tätigkeit als Dozent an der Berner Fachhochschule (SWS) in den Bereichen Java EE Architektur und Design, Persistenztechnologien und DevOps kann er seine Interessen vertiefen und sein Know-How weitergeben."
    },
    {
      "id": 28,
      "name": "Stefan",
      "surname": "Zeller",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/sz.jpg",
      "bio": ""
    },
    {
      "id": 29,
      "name": "Thomas",
      "surname": "Siegrist",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ts.jpg",
      "bio": ""
    },
    {
      "id": 30,
      "name": "Tobias",
      "surname": "Denzler",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/td.jpg",
      "bio": ""
    },
    {
      "id": 31,
      "name": "Tse",
      "surname": "Akumawah",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/ta.jpg",
      "bio": ""
    },
    {
      "id": 32,
      "name": "Stefan",
      "surname": "Tilkov",
      "email": "",
      "company": "innoQ",
      "picture": "images/referenten/st2.jpg",
      "bio": "Stefan Tilkov ist Geschäftsführer und Principal Consultant bei der innoQ Deutschland GmbH, wo er sich vorwiegend mit der strategischen Beratung von Kunden im Umfeld von Softwarearchitekturen beschäftigt. Er ist Autor des Buchs “REST und HTTP”, Mitherausgeber von “SOA-Expertenwissen” (beide dpunkt.verlag), Autor zahlreicher Fachartikel und häufiger Sprecher auf internationalen Konferenzen."
    },
    {
      "id": 33,
      "name": "Bernhard",
      "surname": "Rytz",
      "email": "",
      "company": "IT",
      "picture": "images/referenten/br.jpg",
      "bio": ""
    },
    {
      "id": 34,
      "name": "Christoph",
      "surname": "Frei",
      "email": "",
      "company": "IT-SCI-TPR",
      "picture": "images/referenten/cf.jpg",
      "bio": ""
    },
    {
      "id": 35,
      "name": "Stefano",
      "surname": "Trentini",
      "email": "",
      "company": "IT-SWE",
      "picture": "images/referenten/st.jpg",
      "bio": ""
    },
    {
      "id": 36,
      "name": "Markus",
      "surname": "Färber",
      "email": "",
      "company": "BLS",
      "picture": "images/referenten/mfa.jpg",
      "bio": ""
    }

  ],
  "talks": [
    {
      "id": "intro",
      "title": "Begrüssung & Infos",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "eroeffnungsrede",
      "title": "Eröffnungsrede",
      "abstract": "",
      "speakerIds": [
        35
      ],
      "common": true
    },
    {
      "id": "keynote1",
      "title": "Keynote 1 - Kunden, Menschen – was hat dies mit SmartRail 4.0 zu tun?",
      "abstract": "<p><ul><li>Mobilität ist ein zentraler Erfolgsfaktor in unserer Volkswirtschaft der Schweiz und wir sind als Bewohner dieses Landes heute darauf eingestellt, diese frei zu nutzen – gerade wie wir sie individuell benötigen. Dieses Grundbedürfnis wird sich weiter verstärken.</li><li>Ein paar Indikationen kündigen jedoch deutlich an, dass wir uns nicht auf den erarbeiteten Lorbeeren ausruhen können, sondern ins Handeln kommen müssen. Sonst werden uns andere ein- und überholen.</li><li>Backbone des öffentlichen Mobilitätssystems ist (heute noch) die Bahn. Doch sie gilt als teuer, eher unflexibel und andere Verkehrsträger holen gerade deutlich auf und einige prophezeien gar schon das Ende der Bahn.</li><li>Wir glauben, dass die Bahn eine reale Chance hat auch in Zukunft eine entscheidende Rolle zu spielen. Voraussetzung ist jedoch, dass wir bei deren Weiterentwicklung noch viel konsequenter von den Menschen ausgehen müssen, die diese Mobilität auch nutzen wollen/werden – nicht nur die Bahnnutzer</li><li>SR4.0 ist kein technisches Programm, sondern ein Kundeprojekt, welches Technik konsequent nutzt um Kundenbedürfnisse wertorientiert zu realisieren – ganz im Sinne der Nachhaltigkeit.</li><li>Als Entwickler sind wir gefordert und nur erfolgreich, wenn wir ganz individuell bereit sind wie ein  Kunde zu denken und zu handeln.</li></ul></p>",
      "speakerIds": [
        33,
        34
      ],
      "common": true
    },
    {
      "id": "keynote2",
      "title": "Keynote 2 - Nachhaltige Architekturen: Modularität durch 'Self-contained systems'",
      "abstract": "<p>Jahrelang haben Architekten versucht, möglichst viel zu standardisieren und Effizienz durch Homogenität zu erzielen. Aber häufig sind nur ein paar Versionen eines erfolgreichen Software-Systems notwendig, um es zu einem monolithischen, unwartbaren Klotz am Bein werden zu lassen, der Unmengen an Geld kostet und allen den Spaß an der Arbeit vermiest. In diesem Vortrag werfen wir einen Blick auf einige der Gründe für  diesen Effekt und sehen uns danach den Lösungsansatz SCS (Self-contained Systems) an, der Modularisierung durchein „System    of Systems“ in den Mittelpunkt stellt und viele Ähnlichkeiten, aber auch einige Unterschiede zu den aktuell viel besprochenen Microservices hat.</p>",
      "speakerIds": [
        32
      ],
      "common": true
    },
    {
      "id": "pause",
      "title": "Pause",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "mittagessen",
      "title": "Mittagessen",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "A1",
      "title": "A1 – Hilfe, die Affen kommen! Überleben mit resilienten Anwendungen.",
      "abstract": "<p>Bei verteilten Systemen, wie wir sie oft in der SBB antreffen, funktionieren traditionelle Stabilitätsansätze nicht, bei denen versucht wird Zuverlässigkeit und Verfügbarkeit zu maximieren. Beim Resilient Software Design geht man hingegen davon aus, dass Fehler passieren und erstellt das System so, dass damit umgegangen werden kann: Do not try to avoid failures. Embrace them. In diesem Vortrag stellen wir die Grundprinzipien des Resilient Software Design Isolation, Redundanz, Lose Kopplung und Fallback vor und zeigen, wie wir das in der Applikation touri umgesetzt haben.</p>",
      "speakerIds": [
        1,
        28
      ],
      "common": false
    },
    {
      "id": "A2",
      "title": "A2 - Double Session",
      "abstract": "<p><b>Let’s do APIs!</b><br>Die SBB braucht im Umgang mit ihren Assets einen Weckruf. Wir müssen die Sichtweise auf Schnittstellen verändern und ihnen die längst nötige Aufmerksamkeit widmen. Der Vortrag präsentiert die dazu notwendigen Technologien und Werkzeuge und gibt einen Einblick in die Ideologie.</p><p><b>Mit Open Data an die Weltspitze</b><br>Der öffentliche Verkehr wird mehr und mehr ein riesengrosses Schnittstellenthema: der nahtlose Datenaustausch zwischen Transportunternehmen, Verkehrsmitteln, allerlei Onlineplattformen, Apps und mit Open Data auch der interessierten Öffentlichkeit ist eine Herausforderung — erst recht wenn es um Echtzeit-Datenströme geht. Um dieser Herausforderung Herr zu werden, braucht es professionelles API-Management. Tyk (http://tyk.io) ist eine moderne, leistungsfähige und skalierbare API Management Plattform, Open Source und in Go geschrieben, die das Erstellen, Verwalten, Analysieren, Absichern entwicklerfreundlicher Schnittstellen endlich einfach und sicher macht. Was konkret kann Tyk, wie arbeitet es sich damit, und wohin geht die Reise in Sachen APIs? Jenni und Gassert arbeiten bei Liip Bern, wo Tyk für die SBB aufgebaut und bei opentransportdata.swiss erstmals eingesetzt wurde. Sie teilen an den DevDays erstmals ihre Erfahrungen und Ideen dazu.</p>",
      "speakerIds": [
        29,
        10
      ],
      "common": false
    },
    {
      "id": "A3",
      "title": "A3 - Mit Kulturwandel zu moderner Software",
      "abstract": "<p>Produkt NeTS - nicht gerade berühmt berüchtig für moderne und reaktive Architekturen und Lösungen. Ein klassisches JEE-Projekt der ersten Stunde mit allen vorstellbaren und gut bekannten Gebrechen. Stetiger Fachlicher und Technischer Druck mit Vorhaben wie Smart Rail oder auch der EOL-Phase der WAS 8.5 Plattform drohen auch die letzte Bastion einzureissen.<br>Monolithische Architekturen solcher Grösse abzulösen erfordert eine gehörige Portion Kreativität und in den Augen der etablierten Welt auch Leichtsinn. Wie sonst kann man sich auf neue Modelle wie Devops stürzen und mit klassischen rollenbildern brechen.<br>Um den Monolithen ins aktuelle Jahrzehnt zu transformieren, zeigen wir Mittel und Wege auf Architektonischer Seite wie auch Organisatorische und Kulturelle Aspekt auf.</p>",
      "speakerIds": [
        4,
        9,
        3
      ],
      "common": false
    },
    {
      "id": "A4",
      "title": "A4 - Serverless Computing",
      "abstract": "<p>Das Angebot und die Nutzungsmöglichkeiten von Cloud-Services wachsen rasant an. Nebst der IaaS, PaaS und SaaS Angeboten, gibt es mittlerweile von einigen Cloud-Anbietern die Möglichkeit, Funktionen ereignisgesteuert aufzurufen und bedarfsgerecht abzurechnen. Dieser Ansatz wird Serverless Computing genannt (bekannt auch als Function as a Services – FaaS).<br>Beim Einsatz von Serverless Computing wird die Skalierbarkeit und Ausfallsicherheit der Infrastruktur vom Entwickler wegabstrahiert.  Das bedeutet, dass der Serverless-Service sich um die Bereitstellung der notwendigen Server und weiterer Ressourcen kümmert und zu jeder Zeit sicherstellt, dass die Anwendung ständig ausreichend Ressourcen zur Verfügung hat, um performant Anfragen zu beantworten. Der Cloud-Service organisiert hierbei unter anderem die automatische Skalierung der Server-Infrastruktur, des Speichers, des Netzwerks und anderer Ressourcen und übernimmt somit eigenständig das Kapazitätsmanagement.<br>Im ersten Teil dieses Vortrages werden wir die grundlegendsten Konzepte, sowie die Vor- und Nachteile von Serverless Computing vorstellen.<br>Im zweiten Teil werden wir  auf den Aufbau und die Architektur der AWS Serverless Plattform (AWS Lambda) eingehen.</p>",
      "speakerIds": [
        12
      ],
      "common": false
    },
    {
      "id": "B1",
      "title": "B1 - Double Session",
      "abstract": "<p><b>jOOQ – Typesafe SQL direkt in Java</b><br>Hast du auch das Gefühl, dass Hibernate nicht die Lösung für alle Fälle sein kann? Frisst das N+1 Problem die Performance weg? ORMs sind ideal, um komplexe Objektgraphen auf Datenbanken abzubilden. Sie können jedoch auch zu ineffizientem oder schwer wartbarem Code führen. jOOQ ist eine Alternative, welche wir seit einem Jahr erfolgreich in unserer datenbanklastigen Applikation einsetzen. Mit jOOQ schreiben wir SQL direkt in Java, ohne die Nachteile von „SQL-Strings“ und JDBC-Boilerplate. jOOQ stellt die Korrektheit der SQL-Syntax und der Datentypen zur Kompilierzeit sicher. Anhand unserer Erfahrungen stelle ich jOOQ und ORMs gegenüber, und zeige, wann der Einsatz von jOOQ sinnvoll sein kann.</p><p><b>Jenkins Pipeline & Deployment-Konfiguration: Demo mit Openshift</b><br>Neu unterstützt Jenkins Jenkinsfiles: Damit definiere ich in meinem Git Repository, wie mein Projekt gebuildet werden soll. Jenkinsfiles sind deklarativer als bisherige Jenkins-Konfigurationen: ich sage eher WAS ich builden will und nicht mehr WIE. Ausserdem kann ich damit Openshift-Operationen bequem in einer Groovy DSL definieren. Damit sind Operationen wie Builds, Unit-Tests, Qualitätschecks, Deployments nach Jenkins, End-to-End Tests, Staging usw. einfacher möglich. Wir zeigen kurz was ESTA Cloud anbietet und was damit möglich wird (Jenkins ist eigentlich ein WZU Thema).</p>",
      "speakerIds": [
        13,
        24,
        30
      ],
      "common": false
    },
    {
      "id": "B2",
      "title": "B2 - Verteiltes Machine Learning im Dienste der Pendler",
      "abstract": "<p>Vor dem Betreten des Zuges wissen, welcher Wagen am wenigsten belegt ist? Die Antwort automatisiert zu liefern ist Ziel des Belegungsprognose-Service (Pilotprojekt „Cleverpendeln“), mit geplanter Ausgabe auf SBB Mobile. Dafür werden Millionen Belegungsdatensätze (gemessen von Zugbegleitern) mit Variablen wie Abschnitt, Klasse, Wagenposition, Reservationen, Wetter, etc. in einem Entscheidungsbaum-Algorithmus (xgboost) abgeglichen. Die Speicheranforderungen überfordern allerdings selbst noch so athletische Maschinen. Der Ausweg: H2O, eine open-source Lösung für verteiltes maschinelles Lernen, Huckepack aufgesetzt auf Spark. Wir zeigen euch die Ausgangslage, die Daten und wie komplizierte Prognosemodelle auf der Big Data Plattform der SBB berechnet werden.</p>",
      "speakerIds": [
        23
      ],
      "common": false
    },
    {
      "id": "B3",
      "title": "B3 - Die Suchmaschine – das Q in CQRS",
      "abstract": "<p>Das CQRS Pattern (Command-Query-Responsibility-Segregation) unterteilt das Datenmodell in zwei spezifische Modelle. Eines für das Abfragen/Anzeigen (Query) und eines für die Veränderungen (Command) der Daten. Während das Command-Modell mit traditionellen Mitteln wie O/R-Mapping und relationalen Datenbank implementiert werden kann, stellt sich die Frage wie das Query-Modell umgesetzt werden soll. Eine Möglichkeit ist die Verwendungen einer Suchmaschine wie Apache Solr oder Elasticsearch. Anhand eines konkreten Projektbeispiels aus dem Grosshandelsumfeld wird aufgezeigt, wie die Suchmaschine für das Query-Modells eingesetzt werden kann, wie die Daten der relationalen Datenbank in den Suchindex gelangen und welche speziellen Features der Suchmaschine, wie z.B. Synonyme, Auto-Suggest, oder Boosting, quasi «gratis» mitbenutzt werden können.</p>",
      "speakerIds": [
        27
      ],
      "common": false
    },
    {
      "id": "B4",
      "title": "B4 - SRE, DevOps done right",
      "abstract": "<p>Endlich hat die SBB ihren Cloudstack in Produktion. Nur ist es „DevOps“ wenn Teams selbst in Produktion deployen? Namhafte Cloud-Natives wie Netflix, Spotify, Google, Facebook, Uber, Dropbox unterhalten für Stabilität, Skalierung und Enabling der Entwickler spezielle Teams aus Site Reliability Engineers (SRE), welche das DevOps-Paradigma „implementieren.</p><p>Dieser Vortrag skizziert die Rolle von SRE in verschiedenen Organisationen und setzt sie in Relation zu unseren heutigen Deployment-, Releasing- und Incidentprozessen. Anhand von konkreten Beispielen wird gezeigt, welche Probleme sie damit angehen, welche Werkzeuge sie dafür nutzen und in welcher Kultur dies resultierte.</p>",
      "speakerIds": [
        26,36
      ],
      "common": false
    },
    {
      "id": "C1",
      "title": "C1 - React & Redux - Eine Alternative zu Angular",
      "abstract": "<p>React ist eine moderne JavaScript Library für die Erstellung von User Interfaces. Der Fokus liegt dabei bei der Erstellung von komplexen Single Page Applikationen. In nur 4 Jahren hat sich React zu einem der populärsten Web-Frameworks entwickelt und wir von unzähligen Firmen verwendet (Facebook, Apple, Microsoft, Netflix …) und viele Produkte setzen React ein (Jenkins, Firefox, WhatsApp, Office UI Fabric …).</p><p>React findet nicht nur in der Web-Entwicklung, sondern auch bei der Entwicklung von nativen Mobile-Apps (React Native) eine grosse Verbreitung. In seinem Kern bietet React ein sehr einfaches, aber mächtiges Komponenten-Model. React bricht dabei mit der traditionellen Separierung von Layout (HTML) und Verhalten (JavaScript): Mittels JSX können Templates im JavaScript Code deklariert werden. Dieser neue Ansatz erlaubt eine effiziente und produktive Programmierung. Bei der Programmierung von React Komponenten kommen Konzepte aus der funktionalen reaktiven Programmierung zum Einsatz. Muster aus der funktionalen reaktiven Programmierung können auch als Architektur-Pattern eingesetzt werden.Eine Ausprägung davon ist die „Flux“-Architektur, welche die im React-Ökosystem verbreitet ist. Flux stellte eine Alternative zu dem traditionellen MVC Pattern dar um den State einer Web-Applikation zu verwalten.</p><p>Redux ist eine besonders innovative Implementation des Flux Pattern und findet vor allem im Zusammenspiel mit React grossen Anklang. Redux kann aber auch mit anderen Frameworks (z.B. Angular) eingesetzt werden. React und Redux brechen mit dem traditionellen „De-Facto Standard“ in der Webentwicklung. Mit neuen innovativen Ansätzen wird die Frontend-Entwicklung vereinfacht. Selbst wenn React nicht direkt in einem aktuellen Projekt eingesetzt wird, lohnt es sich daher die Ansätze von React und Redux zu studieren.</p>",
      "speakerIds": [
        14
      ],
      "common": false
    },
    {
      "id": "C2",
      "title": "C2 - Amazon Web Services Nutzung bei WZU",
      "abstract": "<p>Im Februar 2017 hat das Team WZU sämtliche Entwicklungswerkzeuge in die Public Cloud zu Amazon Web Services migriert. Das Vorhaben kam einem kleinen RZ-Move gleich, denn dabei wurden knapp 100 Server mit 25 TB Daten und 500 CPUs in die Wolke verschoben. Doch man hat nicht nur das RZ gewechselt, sondern auch die Arbeitsweise an die Möglichkeiten einer Public Cloud angepasst und im Team etabliert. Themen wie Infrastructure-as-Code, Automatisierung oder Immutable Infrastructure werden bei uns aktiv gelebt. In diesem Vortrag möchten wir aufzeigen wie wir diese Methodiken implementiert haben und welche Vorteile sie für uns und evtl. auch für euch bringen.</p>",
      "speakerIds": [
        11
      ],
      "common": false
    },
    {
      "id": "C3",
      "title": "C3 - Schnittstellen - die Achillesferse von 'Agile'",
      "abstract": "<p>In der Entwicklung bewegen wir uns an in dem meisten Vorhaben langsam in die Richtung agilen Vorgehens und wollen so immer öfter rasch unmittelbaren Nutzen für unsere Kunden und Mitarbeiter schaffen. Leider enden unsere Möglichkeiten meist abrupt, wenn es darum geht Schnittstellen anzubinden (bzw. Daten von anderen Systemen zu beziehen. Die Schnittstellen sind sehr aufwändig zu konsumieren, auf sehr schwergewichtige Systeme ausgerichtet und jede Änderung, aber oft sogar auch schon jede Anbindung erfordert einen hohen organisatorischen Aufwand und lange Vorlaufzeiten, die nicht ins agile Vorgehen passen und uns eine pragmatische Lösungsfindung sehr oft verunmöglichen.</p><p>Daher fliesst ein grosser Teil unseres Entwicklungsaufwandes - oft mehr als die Hälfte - statt in die Umsetzung von tatsächlich nutzbaren Features in die Anbindung von Schnittstellen, unsere Entwicklung wird langsam und teuer. Und es ist zu erwarten dass dieses Problem mit der fortschreitendenden Durchdringung des Geschäfts mit IT immer schlimmer werden wird, wenn es uns nicht gelingt hier andere Wege zu finden.</p><ul><li>Wie ist es dazu gekommen, warum ist die Situation heute so?</li><li>Ist das unvermeidbar? Oder was können wir besser machen, woran scheitert es?</li><li>Hindern uns vor allem technische Probleme, oder liegt es an der Organisation?</li></ul>",
      "speakerIds": [
        8
      ],
      "common": false
    },
    {
      "id": "C4",
      "title": "C4 - Be In / Be Out ohne Hardware?",
      "abstract": "<p>In den letzten Jahren hat sich auf dem Markt einiges getan und diverse Anbieter arbeiten bereits im Bereich automatische Zug und/oder Reiseerkennung mit der SBB zusammen. Da aber alle Lösungen aus einem oder mehreren Gründen nicht ideal sind, kam die Frage auf: Können wir das selbst machen?</p><p>Im Rahmen des Vortrags werden die Schwierigkeiten und mögliche Lösungen für diese Herausforderungen vorgestellt und diskutiert. Zusätzlich werden die Resultate eines PoCs präsentiert und die Frage nach dem 'Können wir das?' beantwortet.</p>",
      "speakerIds": [
        18
      ],
      "common": false
    },
    {
      "id": "D1",
      "title": "D1 - In Ludicrousspeed to production with JHipster + Openshift",
      "abstract": "<p>Wir erstellen vor dem Publikum eine Applikation mit dem Generator JHipster welches SBB Technologien (Spring-Boot, Spring-Data, Hazlecast, Angular JS, Angular 4, Liquibase usw.) als Basis verwendet. Das Ziel ist es in 40 Minuten eine Applikation mit diversen Business Entitäten in SBB Look zu erstellen und produktiv in der SBB Cloud zu deployen. Es soll zeigen wie man innerhalb der SBB sehr schnell eine lauffähige Applikation in Produktion bringen kann. Der JHipster-Generator bringt sehr viel Knowhow über Spring und Angular und das Zusammenspiel all dieser Komponenten mit. JHipster kann einem Projekt enorm Zeit für das Bootstrapping einer Applikation einsparen. Auch verkürzt es die Einarbeitungszeit in all die Technologien, da es das Zusammenspiel der Technologien sehr gut vereint.Provisorisch Runbook:<ul><li>Kurzübersicht JHipster (5min)</li><li>JHipster initial Generierung (5min)</li><li>Customizing (10min - im Hintergrund läuft JHipster Generierung)</li><li>Deployment (10min)</li><li>Präsentation UI & Code Struktur zeigen (5min)</li><li>Fragen und Antworten (5min)</li></ul>Detailliertes Runbook (https://confluence.sbb.ch/display/CISINFRAE/Detailliertes+Runbook)</p>",
      "speakerIds": [
        6,
        17
      ],
      "common": false
    },
    {
      "id": "D2",
      "title": "D2 - G# - GIS für alle @SBB",
      "abstract": "<p>G# (Geodata Shared Platform) ist eine GIS Plattform der SBB für die SBB. Dieser Vortrag richtet sich an alle Interessenten, welche in irgendeiner Form Geodaten in der SBB verwalten, publizieren oder visualisieren wollen. Der Vortrag deckt das komplette Spektrum ab und veranschaulicht die Architektur und den Aufbau der Plattform, sowie dessen vielfältige Einsatzmöglichkeiten mit allen möglichen Technologien. Erstellen von einfach konfigurierbaren Web-Applikationen bis hin zu vollständigen Eigenentwicklungen im Web- oder iOS Umfeld. Der Vortrag wird anhand von konkret umgesetzten Beispielen mit der Verwendung der G# Plattform, untermauert. Der Vortrag soll die Vielfältigkeit der Plattform, sowie bereits einige Lessons Learned aufzeigen.</p>",
      "speakerIds": [
        20,
        16
      ],
      "common": false
    },
    {
      "id": "D3",
      "title": "D3 - Eine explizite Versionierung ist möglich",
      "abstract": "<p>Im Projekt SVS haben wir den alten Monolithen mittlerweile erfolgreich in einen verteilten Monolithen zerlegt. Damit haben wir ein Zwischenziel erreicht. Ein weiterer Schritt autonomere Anwendungen zu bekommen besteht in der expliziten Serviceversionierung. In meinem Vortrag möchte ich vorstellen<ul><li>Warum braucht es Serviceversionierung?</li><li>Mögliche Implementierungen mit Ihren Vor- und Nachteilen kurz vorstellen</li><li>Was haben wir gelernt</li></ul></p>",
      "speakerIds": [
        19
      ],
      "common": false
    },
    {
      "id": "D4",
      "title": "D4 - AngularJS 2 & Reaktive Programmierung",
      "abstract": "<p>AngularJS 2+ bringt nebst dem neuen Framework auch die reaktive Programmierung in die Webentwicklung. Viele Konzepte in AngularJS 2 basieren auf diesen Methoden & Modellen.Diese Art der Entwicklung bringt viele Vorteile aber auch ein Umdenken in der Art wie man Web-GUIs entwickelt.</p><p>In diesem Vortrag zeigen wir zum einen den neuen ESTA WebJS 2 Stack. Zum anderen zeigen wir anhand von verschiedenen Beispielen die reaktive GUI-Programmierung. Wir gehen dabei auf Themen wie Streams, Observables, RxJS und Websockets ein.</p>",
      "speakerIds": [
        15,
        25
      ],
      "common": false
    },
    {
      "id": "E1",
      "title": "E1 - Testing Java Code Effectively",
      "abstract": "<p>The Java ecosystem has myriads of libraries and projects that can be used to create the features our customers require, there's no shortage of options everywhere you look when it comes to writing production code. But what about testing code? If you ascribe to the Clean Code ideals then you know that testing code is as important as production code. Luckily there are a good number of libraries that can be used with popular testing frameworks. In this session we'll discover how to write better parameterized tests; take care of concurrency related events; spy/mock/stub out collaborators to ensure cleaner and isolated tests; fake out REST APIs to test out client code; fake out REST clients to test out server code, and more.</p>",
      "speakerIds": [
        2
      ],
      "common": false
    },
    {
      "id": "E2",
      "title": "E2 - RCS und der Bazaar: Die Migration zu Eclipse 4",
      "abstract": "<p>RCS-D auf E4 zu migrieren ist nicht trivial: RCS-D ist eine grosse RCP Anwendung mit Echtzeitdarstellung der Zugsbewegungen und teilt sich die Codebasis teilweise mit ALEA. Für die Migration haben wir EclipseSource ins Boot genommen, um bei der Problembehebung Unterstützung zu bekommen—oder Bugs in E4 direkt zu flicken! In diesem Vortrag teilen wir unsere Erfahrung mit dieser Zusammenarbeit und reflektieren über die Dynamik des Open Source Modells.</p>",
      "speakerIds": [
        7,
        21
      ],
      "common": false
    },
    {
      "id": "E3",
      "title": "E3 - Double Session",
      "abstract": "<p><b>Understanding your Team members for a better Software</b><br>The Enneagram of personality classifies humans in 9 distinct categories with eventual attachments to other categories. Usually, software development team usually comprises of people with different categories. Knowing how each and every team member “works” increases our chance to work more efficiently with them. My short presentation would explain the different categories which exist and help the listeners to analyse themselves and maybe try to know their colleagues. A better understanding of each and every individual in software development teams would help us best allocate the human resources for most efficient result. Close up by analysing the applicability in SBB.</p><p><b>Consumer Driven Contract für Web Services Unit Testing</b><br>Eine Herausförderung für Web Service Hersteller mit viele Abnehmer und viele Releases ist sicher zu sein, dass die neue Release kompatible mit allen seinen Abnehmern ist.   Consumer Driven Contract  (CDC) hilft dieses Herausförderung zu meistern. Das Konzept ist einfach: jede Benützer von dem Web Service schreibt ein oder mehrere Unit Test für den Web Service Hersteller. Diese Unit Test laufen bei Web Service Hersteller. Der Web Service Hersteller merkt sofort wenn er das Kontrakt mit einem oder mehreren Abnehmer bricht. Dieser Vortrag wird anhand von realen Beispielen zeigen was Consumer Driven Contracts sind und wie dieses Konzept in das reale Welt funktioniert.</p>",
      "speakerIds": [
        31,
        5
      ],
      "common": false
    },
    {
      "id": "E4",
      "title": "E4 - New style Streaming with Hazelcast Jet",
      "abstract": "<p>Tradionally, data processing is post-processing. Data is stored in a data warehouse or database and we process it from where it is held. As we can only compute on what is held, this model has two intrinsic costs -- the money cost of storage, and the time costs for the storage technology.</p><p>Although storage technology gets cheaper and faster, the data ingest rate is increasing exponentially so this is a race it has lost. What we need to do is process data as it arrives, storing any subset of derived or original results that suit us.</p><p>This is what Hazelcast Jet does, a new offering in the stream processing world offering genuine infinite stream and micro-batch handling, all deployed with the ease and speed of Hazelcast. You can literally be up and running in minutes, and processing in microseconds.</p><p>In this talk I'll cover real world use of Jet, taking a simple Java jar as as deployment unit, using Kafka as a data source, analyse a stream of observations and saving only the insights calculated from this. What we'll see is that Jet is super easy to get started, uses the powerful directed acyclic graph as it's base construct, extends out with a *distributed* version of Java streams, so the programmer gets all the benefits of scaling for very little coding.</p><p>lanyrd.com/profile/neilstevenson/bio/</p>",
      "speakerIds": [
        22
      ],
      "common": false
    },
    {
      "id": "outro",
      "title": "Abschluss Developer Day 2017",
      "abstract": "",
      "speakerIds": [],
      "common": true
    },
    {
      "id": "apero",
      "title": "Apéro",
      "abstract": "",
      "speakerIds": [],
      "common": true
    }
  ],
  "tracks": [
    {
      "id": "technologies",
      "title": "Technologies",
      "presentations": [
        {
          "id": "intro",
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:05"
          },
          "roomId": "1"
        },
        {
          "id": "eroeffnungsrede",
          "talkId": "eroeffnungsrede",
          "time": {
            "start": "09:05",
            "end": "09:15"
          },
          "roomId": "1"
        },
        {
          "id": "keynote1",
          "talkId": "keynote1",
          "time": {
            "start": "09:15",
            "end": "10:00"
          },
          "roomId": "1"
        },
        {
          "id": "pause",
          "talkId": "pause",
          "time": {
            "start": "10:00",
            "end": "10:30"
          },
          "roomId": "1"
        },
        {
          "id": "A1",
          "talkId": "A1",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "2"
        },
        {
          "id": "B1",
          "talkId": "B1",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "2"
        },
        {
          "id": 50,
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "1"
        },
        {
          "id": "C1",
          "talkId": "C1",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "3"
        },
        {
          "id": "D1",
          "talkId": "D1",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "3"
        },
        {
          "id": "pause",
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "1"
        },
        {
          "id": "E1",
          "talkId": "E1",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "3"
        },
        {
          "id": "keynote2",
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:45"
          },
          "roomId": "1"
        },
        {
          "id": "outro",
          "talkId": "outro",
          "time": {
            "start": "16:45",
            "end": "16:55"
          },
          "roomId": "1"
        },
        {
          "id": "apero",
          "talkId": "apero",
          "time": {
            "start": "16:55",
            "end": "18:15"
          },
          "roomId": "1"
        }
      ]
    },
    {
      "id": "plattforms",
      "title": "Plattforms",
      "presentations": [
        {
          "id": "intro",
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:05"
          },
          "roomId": "1"
        },
        {
          "id": "eroeffnungsrede",
          "talkId": "eroeffnungsrede",
          "time": {
            "start": "09:05",
            "end": "09:15"
          },
          "roomId": "1"
        },
        {
          "id": "keynote1",
          "talkId": "keynote1",
          "time": {
            "start": "09:15",
            "end": "10:00"
          },
          "roomId": "1"
        },
        {
          "id": "pause",
          "talkId": "pause",
          "time": {
            "start": "10:00",
            "end": "10:30"
          },
          "roomId": "1"
        },
        {
          "id": "A2",
          "talkId": "A2",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "4"
        },
        {
          "id": "B2",
          "talkId": "B2",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "1"
        },
        {
          "id": "mittagessen",
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "1"
        },
        {
          "id": "C2",
          "talkId": "C2",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "2"
        },
        {
          "id": "D2",
          "talkId": "D2",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "2"
        },
        {
          "id": "pause",
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "1"
        },
        {
          "id": "E2",
          "talkId": "E2",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "4"
        },
        {
          "id": "keynote2",
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:45"
          },
          "roomId": "1"
        },
        {
          "id": "outro",
          "talkId": "outro",
          "time": {
            "start": "16:45",
            "end": "16:55"
          },
          "roomId": "1"
        },
        {
          "id": "apero",
          "talkId": "apero",
          "time": {
            "start": "16:55",
            "end": "18:15"
          },
          "roomId": "1"
        }
      ]
    },
    {
      "id": "engineeringArts",
      "title": "Engineering Arts",
      "presentations": [
        {
          "id": "intro",
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:05"
          },
          "roomId": "1"
        },
        {
          "id": "eroeffnungsrede",
          "talkId": "eroeffnungsrede",
          "time": {
            "start": "09:05",
            "end": "09:15"
          },
          "roomId": "1"
        },
        {
          "id": "keynote1",
          "talkId": "keynote1",
          "time": {
            "start": "09:15",
            "end": "10:00"
          },
          "roomId": "1"
        },
        {
          "id": "pause",
          "talkId": "pause",
          "time": {
            "start": "10:00",
            "end": "10:30"
          },
          "roomId": "1"
        },
        {
          "id": "A3",
          "talkId": "A3",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "1"
        },
        {
          "id": "B3",
          "talkId": "B3",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "4"
        },
        {
          "id": "mittagessen",
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "1"
        },
        {
          "id": "C3",
          "talkId": "C3",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "1"
        },
        {
          "id": "D3",
          "talkId": "D3",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "4"
        },
        {
          "id": "pause",
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "1"
        },
        {
          "id": "E3",
          "talkId": "E3",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "2"
        },
        {
          "id": "keynote2",
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:45"
          },
          "roomId": "1"
        },
        {
          "id": "outro",
          "talkId": "outro",
          "time": {
            "start": "16:45",
            "end": "16:55"
          },
          "roomId": "1"
        },
        {
          "id": "apero",
          "talkId": "apero",
          "time": {
            "start": "16:55",
            "end": "18:15"
          },
          "roomId": "1"
        }
      ]
    },
    {
      "id": "beyond",
      "title": "Beyond",
      "presentations": [
        {
          "id": "intro",
          "talkId": "intro",
          "time": {
            "start": "09:00",
            "end": "09:05"
          },
          "roomId": "1"
        },
        {
          "id": "eroeffnungsrede",
          "talkId": "eroeffnungsrede",
          "time": {
            "start": "09:05",
            "end": "09:15"
          },
          "roomId": "1"
        },
        {
          "id": "keynote1",
          "talkId": "keynote1",
          "time": {
            "start": "09:15",
            "end": "10:00"
          },
          "roomId": "1"
        },
        {
          "id": "pause",
          "talkId": "pause",
          "time": {
            "start": "10:00",
            "end": "10:30"
          },
          "roomId": "1"
        },
        {
          "id": "A4",
          "talkId": "A4",
          "time": {
            "start": "10:30",
            "end": "11:15"
          },
          "roomId": "3"
        },
        {
          "id": "B4",
          "talkId": "B4",
          "time": {
            "start": "11:20",
            "end": "12:05"
          },
          "roomId": "3"
        },
        {
          "id": "mittagessen",
          "talkId": "mittagessen",
          "time": {
            "start": "12:05",
            "end": "13:10"
          },
          "roomId": "1"
        },
        {
          "id": "C4",
          "talkId": "C4",
          "time": {
            "start": "13:10",
            "end": "13:55"
          },
          "roomId": "4"
        },
        {
          "id": "D4",
          "talkId": "D4",
          "time": {
            "start": "14:00",
            "end": "14:45"
          },
          "roomId": "1"
        },
        {
          "id": "pause",
          "talkId": "pause",
          "time": {
            "start": "14:45",
            "end": "15:10"
          },
          "roomId": "1"
        },
        {
          "id": "E4",
          "talkId": "E4",
          "time": {
            "start": "15:10",
            "end": "15:55"
          },
          "roomId": "1"
        },
        {
          "id": "keynote2",
          "talkId": "keynote2",
          "time": {
            "start": "16:00",
            "end": "16:45"
          },
          "roomId": "1"
        },
        {
          "id": "outro",
          "talkId": "outro",
          "time": {
            "start": "16:45",
            "end": "16:55"
          },
          "roomId": "1"
        },
        {
          "id": "apero",
          "talkId": "apero",
          "time": {
            "start": "16:55",
            "end": "18:15"
          },
          "roomId": "1"
        }
      ]
    }
  ],
  "rooms": [
    {
      "id": 1,
      "name": "Pavillon"
    },
    {
      "id": 2,
      "name": "Wytsicht"
    },
    {
      "id": 3,
      "name": "Ussicht"
    },
    {
      "id": 4,
      "name": "SIBE"
    }
  ]
}
